[
  {
    "content": "Tom Dörr (@tom_doerr) posted at 5:19 PM on Thu, Oct 31, 2024:\nThough I'm sure 405B with 8GB vram won't be running at rocket speed",
    "labels": [
      "inference",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "inference"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 0:32 AM on Fri, Nov 01, 2024:\nAn intelligent meeting analysis assistant built on Langflow, Groq, and OpenAI: meetingmind, which can analyze a one-hour meeting in 30 seconds, automatically generating meeting minutes and key information.\n\nFeatures:\n1. Provides a dashboard to view analysis results\n2. Supports audio recording and file upload, automatically transcribing\n3. Automatically extracts key information such as tasks, decisions, issues, insights, deadlines, participants, follow-ups, risks, and agendas",
    "labels": [
      "meeting",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "meeting"
      ]
    ]
  },
  {
    "content": "Tom Dörr (@tom_doerr) posted at 7:39 AM on Mon, Nov 04, 2024:\n\"Label Studio is a multi-type data labeling and annotation tool with standardized output format\"",
    "labels": [
      "LLM",
      "annotation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "annotation"
      ]
    ]
  },
  {
    "content": "Asuka (@askaiwy) posted at 5:29 PM on Sat, May 18, 2024:\n《Knowledge of Shark Liver Oil》\n\nWhen writing this introduction about shark liver oil,\nI spent almost half a month just researching.\nDuring this time, in order to accurately find the corresponding professional terms,\nI repeatedly switched between Chinese, Japanese, and English websites.\nSo,\neveryone must be patient and read to the end!\n\nFirst, we need to distinguish between\nfish oil and fish liver oil.\nFish oil,…",
    "labels": [
      "kids"
    ],
    "label_paths": [
      [
        "kids"
      ]
    ]
  },
  {
    "content": "Xiong Brown (@Stephen4171127) posted at 2:10 PM on Mon, Oct 28, 2024:\nTested Claude\nAI's newly released data analysis feature, uploaded a CSV file, and generated a Dashboard (still React code). The performance of generating multiple charts from a single CSV at once is quite good! I'm wondering if its performance would be even better if the prompts I gave were less specific!\nSince it's experimental, it's very unstable; it took 3 attempts to get results with one prompt, and then Page",
    "labels": [
      "claude",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "claude"
      ]
    ]
  },
  {
    "content": "Tiezhu Ge in CRYPTO (@jiu_sunny) posted at 10:37 PM on Sun, Nov 17, 2024:\nThe first part of the Nvidia $NVDA earnings report series: the chip industry chain and its major players, who are the segment leaders, and what is Nvidia's position in it.\nIn terms of the entire chip industry, it can be simply divided into:\nUpstream - design;\nMidstream - manufacturing;\nDownstream - application.\nThe specific segments are as follows:\n\n📍 Upstream design\n▶️ EDA - chip design tools (Synopsys, Cadence, Siemens, the three together account for more than 70% market share)",
    "labels": [
      "nvidia"
    ],
    "label_paths": [
      [
        "nvidia"
      ]
    ]
  },
  {
    "content": "Geek (@geekbb) posted at 4:15 PM on Wed, Sep 25, 2024:\nyorumi.nvim - Dive into the code, calm as the sea.\n\nIt is a visually pleasing natural color scheme designed specifically for developers. This color combination provides a low-contrast (approximately 8:1) visual effect, making the components appear harmonious while keeping the text clear and readable. It helps reduce visual fatigue, thereby improving work efficiency, reducing eye strain, and increasing coding pleasure.",
    "labels": [
      "vim"
    ],
    "label_paths": [
      [
        "vim"
      ]
    ]
  },
  {
    "content": "elvis (@omarsar0) posted at 6:28 AM on Wed, Dec 11, 2024:\nIBM open-sources Granite Guardian, a suite of safeguards for risk detection\nin LLMs.\n\nThe authors claim that \"With AUC scores of 0.871 and 0.854 on harmful\ncontent and RAG-hallucination-related benchmarks respectively, Granite\nGuardian is the most generalizable and competitive.",
    "labels": [
      "LLM",
      "guardrail"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "guardrail"
      ]
    ]
  },
  {
    "content": "Read “Three Paths to Table Understanding with LLMs“ by Katsiaryna Ruksha on Medium",
    "labels": [
      "LLM",
      "table-understanding"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "table-understanding"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 7:19 PM on Wed, Sep 25, 2024:\nIt's so fast ⚡️ Just after the release of Llama 3.2, an open-source product - napkins, which implements screenshot generation App based on its multimodal capabilities, was released🔥 It soared 127\nStar\n\nLlama 3.2 Vision understands images, Llama 3.1 405B handles reasoning, supports observable and beautiful UI, completely open source! 🤯🤯\n\nSupport immediate online use 👉",
    "labels": [
      "LLM",
      "llama3"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "llama3"
      ]
    ]
  },
  {
    "content": "LysonOber (@lyson_ober) posted at 1:31 PM on Fri, Nov 01, 2024: It made me realize the huge potential of dimensional reduction in the education industry. The original intention was to make development easier, and with the improvement of base models and product capabilities, it won't be long before the image rendering capabilities of the education industry are also disrupted 😂 Previously, Claude Artifacts showed us this power, and projects like @stackblitz undoubtedly give us a glimpse of the future.",
    "labels": [
      "education",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "education"
      ]
    ]
  },
  {
    "content": "Gao Jun (@GoJun315) posted at 8:14 PM on Mon, Jul 29, 2024:\nAn open-source project for real-time interactive streaming digital humans: metahuman-stream, achieving synchronized audio and video dialogue, which can basically reach commercial standards.\n\n1. Supports multiple digital human models;\n2. Supports voice cloning;\n3. Supports interruption of digital human speech;\n4. Supports full-body video stitching;\n5. Supports rtmp and webrtc streaming;\n6. Supports playing custom videos.",
    "labels": [
      "LLM",
      "avatar"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "avatar"
      ]
    ]
  },
  {
    "content": "Ni Shuang (@nishuang) posted at 7:41 AM on Sun, Sep 29, 2024:\nA genius made a full-frame CCD, mirrorless camera with interchangeable lenses\n\n😱\n\nBoth hardware and software are open source",
    "labels": [
      "DIY"
    ],
    "label_paths": [
      [
        "DIY"
      ]
    ]
  },
  {
    "content": "Geek (@geekbb) posted at 5:27 PM on Wed, Jul 03, 2024: The screen sharing tool Screego has a server-side implementation that delivers high-quality video streaming while maintaining low latency, making real-time collaboration and presentations smoother, especially suitable for developers.",
    "labels": [
      "toos"
    ],
    "label_paths": [
      [
        "toos"
      ]
    ]
  },
  {
    "content": "Dream Summer Village (@moeimiku) posted at 6:54 PM on Thu, Sep 12, 2024:\nToday, I accidentally discovered an open-source project.\nRunning SD text-to-image on a CPU can produce an image in less than a second.\nIf you're interested, you can try it out:",
    "labels": [
      "diffusion",
      "vision"
    ],
    "label_paths": [
      [
        "vision"
      ],
      [
        "vision",
        "diffusion"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:16 PM on Mon, Dec 02, 2024:\nCodeTree: Agent-guided tree search method optimizes LLM code generation\n\n「A paper from Salesforce AI Research Institute proposes the CodeTree code generation framework, which significantly improves LLM by constructing a tree search structure and collaborating with four specialized AI Agents\n(Thinker, Solver, Debugger, Evaluator)",
    "labels": [
      "LLM",
      "codegen"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "codegen"
      ]
    ]
  },
  {
    "content": "orange.ai (@oran_ge) posted at 6:16 AM on Thu, Oct 17, 2024:\nHeygen is one of the most successful AIGC applications.\nNot only does Heygen make money, but the second and third places in this field are also very profitable.\nBecause matching audio with lip-syncing and character movements is a necessity among necessities.\nWith it, AI podcasts instantly become AI live streams.\n\nNow, there is finally an open-source version, which is TANGO + Wav2Lip\nTango is used to generate body poses\nWav2Lip is used to generate lip-syncing",
    "labels": [
      "LLM",
      "lipsync"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "lipsync"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:27 AM on Mon, Aug 05, 2024:\nHallucination Index: RAG Special!\n\n@rungalileo launched the Hallucination Index - RAG Special Report, a ranking and evaluation framework for LLMs, analyzing and evaluating based on open source and proprietary, different context lengths.\n\n📈 Report Trend Overview 📉\n\n01 Open source is narrowing the gap\nAlthough proprietary models still offer the best performance due to proprietary training data, models like Gemini, Llama, and Qwen",
    "labels": [
      "LLM",
      "halluncination"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "halluncination"
      ]
    ]
  },
  {
    "content": "qinbafrank (@qinbafrank) posted at 3:59 PM on Thu, Nov 07, 2024: A listed company with a market value of over $50 billion can increase its market value by 46% overnight to $80 billion, which is even more impressive than altcoins. Aplovin is probably the listed company with the largest increase in the US stock market over the past two years, with a 27-fold increase. An in-app advertising platform, the efficiency of AI monetization has significantly improved, and performance has consistently exceeded expectations.",
    "labels": [
      "stock"
    ],
    "label_paths": [
      [
        "stock"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 3:05 PM on Fri, Nov 08, 2024: #Open Source Project Recommendation: Onlook Onlook is an open-source desktop application that allows you to visually design your React UI like Figma, runs locally, and the edited UI will be converted into React code, integrated with Tailwind CSS",
    "labels": [
      "UI",
      "UX"
    ],
    "label_paths": [
      [
        "UI"
      ],
      [
        "UI",
        "UX"
      ]
    ]
  },
  {
    "content": "Yufan Sheng (@amehochan) posted at 11:01 PM on Fri, Jun 07, 2024:\nIn the past two months, I have devoted my personal time to the front-end field and gained the following:\n\n1. Systematically learned ES6, focusing on mastering the features after 2017.\n2. Systematically learned TS and played around with type gymnastics.\n3. Systematically learned Next.js App Router and used it to refactor the first version of my blog.\n4. Systematically learned…",
    "labels": [
      "javascripts"
    ],
    "label_paths": [
      [
        "javascripts"
      ]
    ]
  },
  {
    "content": "Austin（坚持每周分享✊） (@austinit) posted at 9:40 PM on Tue, Nov 05, 2024:\nRecently used FastGPT and dify platforms. The experience with FastGPT completely surpassed dify.\nBecause dify, I couldn't even start it successfully. The docker configuration file is hundreds of lines long, and it defaults to using port 80,\nbut changing it to another port didn't work. It's really terrible. Everything is stuffed into the configuration file.\n\nFastGPT's workflow is amazing, and it has one-api built-in, which is impressive.",
    "labels": [
      "dify"
    ],
    "label_paths": [
      [
        "dify"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 9:57 AM on Wed, Sep 18, 2024:\nThe 50+ page PPT 'Improving LLM Reasoning with RL and Verifiers' shared by Google DeepMind researcher @agarwl_ is amazing🔥\n\nIt is essentially in line with the recently released O1 principles by OpenAI, reporting mainstream research on using LLM for reasoning capability discovery, Paper or technology⚡️",
    "labels": [
      "LLM",
      "chatgpt-o1"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "chatgpt-o1"
      ]
    ]
  },
  {
    "content": "OpenAI (@OpenAI) posted at 10:41 AM on Wed, Oct 30, 2024:\nFactuality is one of the biggest open problems in the deployment of artificial intelligence.\nWe are open-sourcing a new benchmark called SimpleQA that measures the factuality of language models.",
    "labels": [
      "LLM",
      "benchmark"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "benchmark"
      ]
    ]
  },
  {
    "content": "𝓨𝓪𝓷𝓰𝔂𝓲 (@Yangyixxxx) posted at 8:11 AM on Tue, Oct 22, 2024: It's here The visual rpa agent I've been waiting for It's finally here",
    "labels": [
      "LLM",
      "rpa"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "rpa"
      ]
    ]
  },
  {
    "content": "Read “Unlocking the Power of Distributed Inferencing with vLLM“ by Manikandan Thangaraj on Medium.",
    "labels": [
      "LLM",
      "vllm"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "vllm"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 5:12 PM on Wed, Sep 25, 2024:\nQualcomm collaborates with Meta to launch Llama 3.2: A major breakthrough in on-device AI\n@Qualcomm x @AIatMeta\n\nQualcomm and Meta have collaborated to optimize the Llama 3.2 series models, enabling them to run on devices equipped with the Snapdragon @Snapdragon platform. This collaboration aims to advance the development of on-device AI.\n\nQualcomm provides various tools and resources to help developers optimize and deploy Llama 3.2 on the Snapdragon platform:\n- Ollama",
    "labels": [
      "edge",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "edge"
      ]
    ]
  },
  {
    "content": "“custom lemmatization”\n\nRead “NLP: Text Summarization and Keyword Extraction on Property Rental Listings — Part 1“ by Daniel Kristiyanto on Medium",
    "labels": [
      "NLP"
    ],
    "label_paths": [
      [
        "NLP"
      ]
    ]
  },
  {
    "content": "“IDP is an approach that combines AI technologies to automate document processing, transforming unstructured data into structured, actionable insights.”\n\nRead “Claude 3.5 — The King of Document Intelligence“ by Júlio Almeida on Medium:",
    "labels": [
      "IDE"
    ],
    "label_paths": [
      [
        "IDE"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 7:30 PM on Sat, Jun 22, 2024:\nGoogle released Screen AI, a key technology alternative to Apple Intelligence's Ferrt-UI, focusing on core UI processing\nScreen understanding even in chart and document scenarios⚡️💥\n\n- Designed a vision-language model architecture based on PaLI and Pix2Struct\n- Generated screen annotation data using small models and open-sourced the dataset🔥\n- Abstracted 6 tasks, trained 3 models, 675M/1.88B/4.62B",
    "labels": [
      "LLM",
      "smartchart"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "smartchart"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 6:45 PM on Tue, Sep 24, 2024:\nThis is amazing🤯🤯 Surpassing Perplexity Pro? Stanford officially released the multimodal semantic search engine MMSearch-Engine and announced its open source⚡️\n\nSupports integration with open-source models, combined with GPT-4o to surpass commercial search engines, and proposes a multimodal search evaluation benchmark and a basic evaluation set🔥\n\nAlso released core related work for in-depth research! Highly recommended!👏",
    "labels": [
      "LLM",
      "search"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "search"
      ]
    ]
  },
  {
    "content": "Bear Liu (@bearbig) posted at 0:48 AM on Mon, Aug 05, 2024: Everyone can write English blogs: piglei shared his experience of using AI tools to translate Chinese blog posts into English and achieving significant success on platforms like Reddit and Hacker News. AI enabled him to share his insights with a broader audience, demonstrating the potential of AI in overcoming language barriers. #BearwithAI #HowtoAI",
    "labels": [
      "writing"
    ],
    "label_paths": [
      [
        "writing"
      ]
    ]
  },
  {
    "content": "Tom Dörr (@tom_doerr) posted at 11:08 AM on Sun, Oct 13, 2024: OCR toolkit",
    "labels": [
      "LLM",
      "OCR"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "OCR"
      ]
    ]
  },
  {
    "content": "orange.ai (@oran_ge) posted at 7:53 PM on Wed, Jun 26, 2024:\nFigma has also entered the PPT market\nPPT is a universal necessity both domestically and internationally",
    "labels": [
      "LLM",
      "ppt-generation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "ppt-generation"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 7:03 PM on Tue, Sep 24, 2024:\nMarkdown to mind map tool: markmap\nBy parsing Markdown syntax, it generates structured mind maps in real-time\n\nLightweight, integrates with VS Code, Vim/Neovim, Emacs\nSupports real-time rendering, customizable, interactive, and highly embeddable",
    "labels": [
      "git-project",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "git-project"
      ]
    ]
  },
  {
    "content": "Guizang (guizang.ai) (@op7418) posted at 8:59 PM on Wed, Aug 07, 2024: Andrej Karpathy's popular science on RLHF. He believes that the current RLHF in LLM is not true reinforcement learning. It details the limitations and advantages of RLHF and the challenges of true RL in LLM.",
    "labels": [
      "LLM",
      "RLHF"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RLHF"
      ]
    ]
  },
  {
    "content": "Brace (@BraceSproul) posted at 10:07 AM on Sun, Dec 01, 2024:\nUsing LLMs to write emails, blogs, tweets, etc and wish they could remember\nyour past interactions? Open Canvas solves that problem!\n\nUse it for free:\n\nCode:\n",
    "labels": [
      "tools"
    ],
    "label_paths": [
      [
        "tools"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 10:07 AM on Thu, Sep 26, 2024: 10 key modules for achieving high-conversion landing pages🔥 Recommended by a top designer who has designed over 100 startup landing pages in the past 12 months🤯",
    "labels": [
      "visualization"
    ],
    "label_paths": [
      [
        "visualization"
      ]
    ]
  },
  {
    "content": "Leo Xiang (@leeoxiang) posted at 4:45 AM on Mon, Nov 04, 2024:\nRecently, end-to-end audio models have been emerging one after another, resembling the competitive landscape of large models in the past. Voice is the next big thing.\n\n1. hertz\n2. mini-omni2\n3. GLM-4-Voice\n4. moshi\n5. Spiritlm",
    "labels": [
      "LLM",
      "TTS"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "TTS"
      ]
    ]
  },
  {
    "content": "Financial Dog (@yuyy614893671) posted at 0:38 PM on Mon, Jun 24, 2024:\n【Recommendation】\nThis interview with Fang Zhang (founder of Xueqiu, Fang Sanwen) and Gu Mingzhao is highly recommended for everyone to listen to; at least to understand from the perspective of economists:\n\n-The different paths of development for export-oriented and export-substituting countries;\n-The characteristics and coping strategies of society at different stages of economic development;\n-The differences in social development, innovation, and culture between Japan and the United States, and their different impacts on economy and technology;",
    "labels": [
      "podcast",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "podcast"
      ]
    ]
  },
  {
    "content": "Read “Using Phi-3-Vision-128K for Real-World Image Data Extraction: From Invoices to Landmarks“ by Tarun Singh on Medium.",
    "labels": [
      "LLM",
      "structured"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structured"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 8:35 PM on Tue, Sep 24, 2024:\nBuilding a text embedding model with few-shot learning capabilities\n\nThe paper mainly introduces the \"bge-en-icl\" new text embedding model, which leverages the in-context learning (ICL) capabilities of LLMs to generate more adaptable text embeddings,\nnot only improving performance but also providing a more flexible and adaptable framework, which is expected to have a significant impact in various NLP applications.\n\nInnovations:\n- Introducing the ICL capabilities of LLMs into text embedding tasks,",
    "labels": [
      "LLM",
      "embedding"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "embedding"
      ]
    ]
  },
  {
    "content": "Yue Xiaoyu (@yuexiaoyu111) posted at 5:44 PM on Thu, Dec 05, 2024:\n《Web3 Airdrop Beginner's Guide: Every industry newcomer is recommended to start with airdrops, learning while earning!》\n\nThere are two major groups in the Web3 industry: those who trade coins and those who participate in airdrops.\n\nAlthough the opportunities to get rich quickly through airdrops are decreasing, the method of token distribution through airdrops will always exist.",
    "labels": [
      "bitcoin"
    ],
    "label_paths": [
      [
        "bitcoin"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 3:11 AM on Tue, Sep 10, 2024:\nFrom finance to retail @AI21Labs\n——7 ways long-context AI models are transforming business decision-making\n\nWith the continuous increase in LLM context, more and more enterprise scenarios are becoming feasible, and more scenarios are being discovered.\n\nAI21 labs listed 7 major long-context use cases in enterprises:\n- Finance industry:\n01 - Analyzing earnings call transcripts: Can process 8 years (32",
    "labels": [
      "LLM",
      "context"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "context"
      ]
    ]
  },
  {
    "content": "Read “AI in Chip Design Market: Pioneering the Future of Semiconductor Innovation” by Pramod Pawar on Medium",
    "labels": [
      "LLM",
      "chipdesign"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "chipdesign"
      ]
    ]
  },
  {
    "content": "Susan the dice tree (@feltanimalworld) posted at 3:38 PM on Sat, May 11, 2024: Starting with a picture, guiding GPT to manually create small electronic hardware, I call on parents with children to pay attention and try it. As long as your English is good enough and Huaqiangbei is not far from you, why not give it a try? As I understand, top STEM high schools in the U.S. like Thomas Jefferson…",
    "labels": [
      "good_material",
      "IOT"
    ],
    "label_paths": [
      [
        "good_material"
      ],
      [
        "IOT"
      ]
    ]
  },
  {
    "content": "Read “HybridAGI — A Neural Symbolic Framework for AGI“ by Minh Le Duc on Medium",
    "labels": [
      "knowledge"
    ],
    "label_paths": [
      [
        "knowledge"
      ]
    ]
  },
  {
    "content": "Jintao Zhang (@zhangjintao9020) posted at 5:50 AM on Tue, Jun 04, 2024:\nGoogle has open-sourced a Python-based UI framework called Mesop, which is somewhat similar to components like streamlit and Gradio. The examples look like Gemini. These components are probably more for quickly building applications that use #LLM APIs.",
    "labels": [
      "LLM",
      "front-end"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "front-end"
      ]
    ]
  },
  {
    "content": "Will (@FinanceYF5) posted at 0:36 AM on Fri, Dec 13, 2024: 2025 startup trends and ideas",
    "labels": [
      "startup"
    ],
    "label_paths": [
      [
        "startup"
      ]
    ]
  },
  {
    "content": "Nextify (@nextify2024) posted at 7:50 AM on Sat, Aug 10, 2024:\nSummary of foreign technology blogs.",
    "labels": [
      "blog site"
    ],
    "label_paths": [
      [
        "blog site"
      ]
    ]
  },
  {
    "content": "elvis (@omarsar0) posted at 9:05 PM on Mon, Jul 22, 2024:\nText-to-SQL is one of the most popular LLM use cases I have been asked about during my LLM trainings.\nI track this domain very closely but it's great to see a good survey paper on the topic.\nThe survey paper covers prompt engineering techniques, fine-tuning methods.",
    "labels": [
      "LLM",
      "text2sql"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "text2sql"
      ]
    ]
  },
  {
    "content": "Ni Shuang (@nishuang) posted at 8:10 AM on Sat, Sep 21, 2024:\nDo you want to be a T-shaped talent or a V-shaped talent?\n\n#LifelongLearning\n\nHehe, Jobs is a once-in-a-century talent. With the talent and effort of an average person, it would take about 800 years to get the reward.\n\nNowadays, society changes too fast. Industries will decline, professions will shrink, and professional skills will become obsolete. Many highly educated and experienced people cannot adapt to career changes due to their single skill set.",
    "labels": [
      "marketing"
    ],
    "label_paths": [
      [
        "marketing"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 7:56 AM on Mon, Sep 23, 2024:\nPDF to Audio Tool: PDF2Audio, an open-source alternative to NotebookLM\nCan convert PDFs to podcasts, lectures, discussions, short/long text summaries, etc.\n\nSupports uploading multiple PDF files\nSupports different command templates, including podcasts, lectures, summaries, etc.\nCustom text generation and audio models\nSupports different voice options\nSupports custom audio length, tone, style, etc.",
    "labels": [
      "LLM",
      "NotebookLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "NotebookLM"
      ]
    ]
  },
  {
    "content": "Steven Lynn (@Stv_Lynn) posted at 5:08 AM on Fri, Aug 02, 2024:\nMy new fine-tuned model: Gemma-2-2b-Chinese-it (Gemma-2-2b-Chinese)\n\nWelcome to click ❤️like on huggingface\n\nFine-tuned Gemma-2-2b-it using about 6.4k data from Ruozhiba\nSee the demo",
    "labels": [
      "LLM",
      "finetune"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "finetune"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 4:29 PM on Wed, Nov 20, 2024: An automatic video segmentation tool based on SAM2/SAM1: AutoSeg-SAM2, which can automatically segment videos, track objects in videos, and detect new objects. Fully automated processing, no manual intervention required. Supports batch processing of image sequences and can handle videos from different scenes. Useful for scenarios requiring video content analysis, object tracking, video post-production, surveillance analysis, etc.",
    "labels": [
      "vision"
    ],
    "label_paths": [
      [
        "vision"
      ]
    ]
  },
  {
    "content": "orange.ai (@oran_ge) posted at 4:54 PM on Thu, Dec 05, 2024:\nTwenty years of data from YYeTs is open source\nA good dataset",
    "labels": [
      "dataset",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "dataset"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 7:20 AM on Mon, Oct 21, 2024:\nTsinghua University has open-sourced a 1B-parameter dual-arm robot diffusion model: RDT, which can mix drinks and walk 'dogs'.\n\nIt can predict the next actions of the robot based on language instructions and RGB images, and can be used for complex tasks requiring dual-arm coordination.\n\nFeatures:\n1. Pre-trained with over 1 million multi-robot operation clips\n2. Supports multimodal inputs including text, images, and actions\n3. Possesses zero-shot generalization capability",
    "labels": [
      "LLM",
      "robot"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "robot"
      ]
    ]
  },
  {
    "content": "Zhi Jian AI (@shadouyoua) posted at 10:24 PM on Wed, Oct 16, 2024:\n《Tianya Community Divine Posts Collection》The most comprehensive compilation of 999 posts [17GB]\n\nThis collection includes:\nKK Trilogy\nGreat Peng Golden-Winged Ming King\nFinance-related posts\nReal estate-related posts\nHumanities and history-related posts\nSocial hot topic discussions\nHuman nature exploration\nHistorical event analysis\nFinancial investment strategies\nReal estate market analysis",
    "labels": [
      "corpus"
    ],
    "label_paths": [
      [
        "corpus"
      ]
    ]
  },
  {
    "content": "Dreaming Tulpa 🥓👑 (@dreamingtulpa) posted at 3:17 PM on Sat, Jun 08, 2024:\nPacking Collage can pack geometric elements into a given shape!\n\nThe method is highly efficient and can easily accommodate various loss functions, making it suitable for various visualization applications.",
    "labels": [
      "CV"
    ],
    "label_paths": [
      [
        "CV"
      ]
    ]
  },
  {
    "content": "Iron Hand (@0427SMtieshou) posted at 6:20 PM on Thu, Nov 28, 2024: Highly recommended!!! You must buy this book!!! Gabor Mate believes that most chronic diseases and metabolic diseases are caused by accumulated emotions and stress, including hypertension, asthma, Alzheimer's, diabetes, lupus, melanoma, breast cancer, ovarian cancer, prostate cancer, irritable bowel syndrome, and other major diseases.",
    "labels": [
      "book"
    ],
    "label_paths": [
      [
        "book"
      ]
    ]
  },
  {
    "content": "Zhipu has open-sourced its new generation of text-to-image model CogView3-Plus, supporting image generation from 512 to 2048px",
    "labels": [
      "LLM",
      "new-model"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "new-model"
      ]
    ]
  },
  {
    "content": "Read “NVIDIA cuGraph: Accelerate Graph Analytics with GPUs“ by Mehul Gupta on Medium",
    "labels": [
      "CUDA"
    ],
    "label_paths": [
      [
        "CUDA"
      ]
    ]
  },
  {
    "content": "𝗖𝘆𝗱𝗶𝗮𝗿 (@Cydiar404) posted at 0:14 PM on Mon, Aug 12, 2024:\nGood Evening and Juchats and @genie0309\nI re-read 'The Product Philosophy Behind WeChat' by Zhang Xiaolong, and after twelve years, I gained new insights! When a product truly has genes, needs can grow naturally, and the product can develop!",
    "labels": [
      "reading"
    ],
    "label_paths": [
      [
        "reading"
      ]
    ]
  },
  {
    "content": "Viking (@vikingmute) posted at 10:49 PM on Sat, Nov 16, 2024:\nThe recent popular project is this open-source LogoCreator, which uses AI to generate logos.\n\nThe underlying generation is done through Flux Pro, and you can experience it online here:\n\nThere are three Credits",
    "labels": [
      "research-tool"
    ],
    "label_paths": [
      [
        "research-tool"
      ]
    ]
  },
  {
    "content": "Lisheng Chang (@csee) posted at 1:38 AM on Thu, May 23, 2024: The guide to photographic composition is really well explained, unlike those basic things like the rule of thirds that just fool people.",
    "labels": [
      "tips"
    ],
    "label_paths": [
      [
        "tips"
      ]
    ]
  },
  {
    "content": "Read “Guiding an LLM’s Response to Create Structured Output“ by Andrea D'Agostino on Medium.",
    "labels": [
      "LLM",
      "structure-output"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structure-output"
      ]
    ]
  },
  {
    "content": "Lucy's Treasure Box (@Lucy_love_AI) posted at 7:53 PM on Wed, Aug 07, 2024:\nJust experienced a powerful stock API that includes all S&P 500 index stock data.\n\nNot only that, it also provides balance sheets, income statements, cash flow statements, and supports querying data for up to 30 years! The official version will even cover up to 15,000 stocks.\n\nFor those working on financial AI applications, this is a must-have tool!",
    "labels": [
      "Fintech"
    ],
    "label_paths": [
      [
        "Fintech"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 5:07 PM on Wed, Oct 23, 2024:\nRAG Evaluation Engineering Practice: Ragas Metrics System and Comet Opik Integration\n@Cometml @ragas_io\n\nThis document mainly introduces how to use Ragas with the Opik platform to monitor and evaluate the RAG pipeline.\n\nTwo evaluation methods\n\n1. Scoring Traces\n- Suitable for real-time evaluation in production environments\n- Can track the complete processing flow of a single query\n- Able to obtain scoring results in real-time",
    "labels": [
      "RAG",
      "LLM",
      "evaluation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "evaluation"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 4:29 AM on Thu, Aug 22, 2024:\nAn LLM-based web crawler tool: CyberScraper-2077, integrated with OpenAI and Ollama\n\nFeatures:\n1. AI-driven: Utilizes AI models to understand and parse web content\n2. Data extraction: Can extract information from complex or unstructured data sources\n3. Streamlit interface: User-friendly graphical interface, easy to operate\n4. Multi-format support: Supports data export in JSON, CSV, HTML, SQL, or Excel",
    "labels": [
      "LLM",
      "website-agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "website-agent"
      ]
    ]
  },
  {
    "content": "Is this person Chinese? His JS course is very popular, with over 3,000 comments. People from all over the world are watching it, and many are thanking him.",
    "labels": [
      "LLM",
      "tutorial"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "tutorial"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 10:49 PM on Sun, Jun 23, 2024: The original image is like this",
    "labels": [
      "funny",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "funny"
      ]
    ]
  },
  {
    "content": "Xiao Hu (@imxiaohu) posted at 1:11 PM on Thu, Nov 14, 2024:\nAnthropic has launched a new feature called 'Prompt Console'.\n\nClaude will use prompt engineering techniques such as chain-of-thought reasoning to automatically improve prompts, optimizing your prompts to make AI responses more accurate and aligned with expectations.\n\nThe main functions of this feature:",
    "labels": [
      "LLM",
      "prompt"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "prompt"
      ]
    ]
  },
  {
    "content": "Ultralytics (@ultralytics) posted at 5:31 PM on Mon, Jul 22, 2024:\n🚀 Exciting news from @Ultralytics! YOLOv8.2.63 is here! 🌟\n\n🔧 Enhanced workflow automation with updated GitHub Actions\n🖼️ Improved segmentation accuracy\n📄 Better documentation reliability\n\n#AI #MachineLearning #YOLO",
    "labels": [
      "LLM",
      "multimodal"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "multimodal"
      ]
    ]
  },
  {
    "content": "ginobefun (@hongming731) posted at 2:26 AM on Fri, Jun 14, 2024: I'm starting to fall in love with dify. Today, I deployed a set of services myself, tried writing a few workflows, and developed while debugging. Compared to the previous method of code orchestration and debugging, the efficiency is much higher. The entire page is very smooth. Later, I will gradually switch some automated workflows to dify.",
    "labels": [
      "LLM",
      "agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "agent"
      ]
    ]
  },
  {
    "content": "Backpack Health (@bbjk666) posted at 10:04 PM on Wed, Nov 20, 2024: One move to improve rounded shoulders and hunchback",
    "labels": [
      "life"
    ],
    "label_paths": [
      [
        "life"
      ]
    ]
  },
  {
    "content": "Tanishq Mathew Abraham, Ph.D. (@iScienceLuvr) posted at 6:40 PM on Sun, Feb 25, 2024:\ntinyBenchmarks: evaluating LLMs with fewer examples\n\nApplying statistical techniques from psychometrics (IRT) to reduce the number of evaluation examples needed to test the abilities of an LLM, therefore reducing…",
    "labels": [
      "good_material",
      "daily_news"
    ],
    "label_paths": [
      [
        "good_material"
      ],
      [
        "daily_news"
      ]
    ]
  },
  {
    "content": "BUPT and HKU have open-sourced a new graph-based RAG system: LightRAG, an advanced version of GraphRAG.\nIt addresses the issue of insufficient context awareness and improves response efficiency, cost, and adaptability to new information compared to GraphRAG.\n\nFeatures:\n1. Introduces graph structure into text indexing and retrieval processes.\n2. Dual-layer retrieval framework, with low-level and high-level retrieval, adaptable to different types of queries.",
    "labels": [
      "RAG",
      "LLM",
      "graph"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "graph"
      ]
    ]
  },
  {
    "content": "Gao Jun (@GoJun315) posted at 5:03 AM on Sat, Jun 29, 2024:\n#Daily Recommendation\n\nAn open-source tool OmniParse that helps you clean and structure data.\n\nThis tool can transform various unstructured data into structured, actionable data, making it convenient for retrieval-augmented generation (RAG) and fine-tuning.\n\nWhether it's documents, tables, images, videos, audio, or web pages, it can clean and structure them.",
    "labels": [
      "PDF"
    ],
    "label_paths": [
      [
        "PDF"
      ]
    ]
  },
  {
    "content": "https://arxiv.org/pdf/2410.10870: domain adaptation without training:\ntraining-free framework that (i) creates an initial lightweight model\nupdate patch to capture domain-specific knowledge, and (ii) allows a\nsubsequent seamless plugging for the continual personalization of evolved\nLLM at minimal cost. They get results similar to LoRA but cheaper in terms\nof GPU memory use.",
    "labels": [
      "LLM",
      "paper"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "paper"
      ]
    ]
  },
  {
    "content": "Shanice (@Shanice_Nici) posted at 7:45 PM on Wed, Oct 16, 2024:\n#DailyShare\nToday, I recommend two efficiency-boosting tools: Galileo AI and Replit 🌋\n\nIndependent developers using these two tools will greatly improve work efficiency, equivalent to directly hiring a UI designer and a development engineer. Making a product in a week is no longer a dream! 🏜️ See below for details.\n\n【Galileo AI】\n· Guide: \n· Galileo AI",
    "labels": [
      "LLM",
      "product"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "product"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 5:48 PM on Thu, Jun 20, 2024:\nA knowledge base Q&A system based on LLM: MaxKB\n\n1. Out-of-the-box: Supports document upload, automatic crawling of online documents, automatic text splitting, vectorization, RAG, etc.\n\n2. Seamless embedding: Supports zero-code quick embedding into third-party business systems\n\n3. Supports multiple models: Mainstream large models, including Ollama local private large models (Meta Llama 3, qwen, etc.), Tongyi Qianwen, OpenAI, Azure",
    "labels": [
      "RAG",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ]
    ]
  },
  {
    "content": "Facewall Intelligence's MiniCPM series has just launched MiniCPM-Llama3-V 2.5\nMiniCPM-Llama3-V 2.5 is claimed to be the strongest edge-side multimodal model\n\nFeatures:\n1. Performance\nOn the OpenCompass benchmark, it scored an average of 65.1, surpassing models like GPT-4V-1106, Gemini Pro, Claude\n3, and Qwen-VL-Max with its 8B scale.\n\n2. OCR capability\nCan accept 180…",
    "labels": [
      "LLM",
      "good_material"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "good_material"
      ]
    ]
  },
  {
    "content": "Guizang (guizang.ai) (@op7418) posted at 8:42 AM on Mon, Jun 10, 2024:\nAndrej Karpathy's new tutorial video teaches you how to implement a 124M GPT-2 model from scratch.\n\nIt's a blessing, the video is 4 hours long, enough to guide you step by step, he says even if you have no foundation at all, you can follow along and implement it.\n\nI translated a version with Memo, originally for my own reference, there might be some issues with the details.\n\nWe start with an empty file and end up with a GPT-2 (124M) model:…",
    "labels": [
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 9:12 AM on Sat, Aug 03, 2024:\nRun a vector database directly on the Raspberry Pi and perform on-device \"semantic similarity matching\" 🤯🤯\n\nSQLite-vec is so cool! It is compatible with the OpenAI Embedding interface and supports offline Embedding",
    "labels": [
      "edge",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "edge"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 1:12 AM on Sat, Aug 03, 2024:\n🗒txtai  @neumll  8.3k✨\n\ntxtai is an all-in-one embeddings database for semantic search, LLM orchestration, and workflows.\n\nAn embeddings database is a combination of vector indexing, graph networks, and relational databases, enabling vector search, topic modeling, RAG, and more using SQL.\nIt can exist independently or serve as a powerful knowledge source for LLM prompts.\n\n🗒txtai feature summary",
    "labels": [
      "NLP"
    ],
    "label_paths": [
      [
        "NLP"
      ]
    ]
  },
  {
    "content": "Recently, there have been many posts about using Cursor. I’d like to share my experience with the four projects I’ve done using AI over the past two months. I’m a heavy user of Claude, spending 16+ hours a day on it.\n\nBefore LLM AI, when I encountered problems in coding (algorithms, logic, design) that I couldn’t solve, I usually had to lie in bed and daydream or sleep, sometimes even waiting until the next day. Occasionally, I would wake up with a solution in my dreams and start writing immediately (those who understand, understand).",
    "labels": [
      "IDE"
    ],
    "label_paths": [
      [
        "IDE"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 7:48 PM on Sat, Jun 22, 2024:\nGoogle Screen AI, based on LLMs, automatically generated a dataset of 22,417 mobile UI-text annotations. It feels like this kind of automatically generated dataset -> synthetic data is a field very worth exploring in the future 💥\n\nRecently, the data annotation project ScaleAI raised 1 billion, which seems to be an inevitable trend. See the financing:",
    "labels": [
      "LLM",
      "smartchart"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "smartchart"
      ]
    ]
  },
  {
    "content": "howie.serious (@howie_serious) posted at 5:46 AM on Mon, Oct 14, 2024:\nAfter using ChatGPT Search for 5 minutes, as a loyal Google user for 20 years, I feel that Google Search is about to be finished.\n\nI am the kind of person who uses Google nearly 100 times a day and has been using it for 20 years. However, the advantages of GPT Search are too obvious.\n\nI recommend everyone to follow @小互's suggestion and try setting GPT Search as the default search engine for a period of time.",
    "labels": [
      "LLM",
      "search"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "search"
      ]
    ]
  },
  {
    "content": "Susan/STEM MOM (@feltanimalworld) posted at 9:49 PM on Sat, Aug 17, 2024:\nI have repeatedly emphasized the importance of starting reflective writing. The biggest regret of my life is not having encountered this methodology and accumulated practice 20 years ago. I am still in the exploratory stage, but I want to share the results of this exploration.\n\nThe importance of reflective writing for people in STEM fields has long been proven.",
    "labels": [
      "writing"
    ],
    "label_paths": [
      [
        "writing"
      ]
    ]
  },
  {
    "content": "Read “Llama 3.2-Vision for High-Precision OCR with Ollama“ by Datadrifters on Medium",
    "labels": [
      "LLM",
      "OCR"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "OCR"
      ]
    ]
  },
  {
    "content": "This is very interesting! Based on the QWen2 0.5 B model. It claims to be OCR 2.0, an end-to-end OCR model with 580M parameters, achieving a BLEU score of 0.972🔥\n\nA 0.58B model, and it's end-to-end multimodal🤔 The results are a bit unbelievable, interested parties can give it a try.",
    "labels": [
      "LLM",
      "OCR"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "OCR"
      ]
    ]
  },
  {
    "content": "Jeffery Kaneda Tatsuya Kanda (@JefferyTatsuya) posted at 11:32 PM on Fri, Sep 27, 2024: Who still needs office?😛",
    "labels": [
      "life",
      "LLM",
      "ppt-generation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "ppt-generation"
      ],
      [
        "life"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:45 PM on Fri, Sep 27, 2024:\nAI PPT Assistant @KaranVaidya6\n\nAn AI Agent that builds PPT documents based on Google Sheets data, utilizing technologies such as LlamaIndex\n@llama_index, Composio @composiohq, CrewAI @crewAIInc, AgentOps @AgentOpsAI, and\nChatGPT.\n\nFeatures include reading tables, drawing charts, discovering key insights, and creating PPT documents.",
    "labels": [
      "LLM",
      "ppt-generation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "ppt-generation"
      ]
    ]
  },
  {
    "content": "A knowledge graph-based intelligent Q&A system: fact-finder\nUtilizes LLM and Neo4j database to achieve automated querying and answering, realizing the automated conversion process from user questions to natural language answers.\n\nFeatures:\n1. Knowledge graph-based: Uses Neo4j database to store and manage the knowledge graph, and leverages it to answer questions.",
    "labels": [
      "git-project",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "git-project"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 6:13 PM on Sun, Aug 18, 2024:\nFaster, with minimal performance loss? The lightweight GraphRAG with 800 lines of code is here ⚡️ 🤯🤯\n\nnano-GraphRAG extracts the core implementation of GraphRAG and allows you to replace the LLM and Embedding\nmodules, providing asynchronous and type-safe implementations, making it ideal for studying GraphRAG source code and adapting it to your own business🔥",
    "labels": [
      "git-project",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "git-project"
      ]
    ]
  },
  {
    "content": "ginobefun (@hongming731) posted at 9:59 PM on Mon, Aug 05, 2024:\n#BestBlogs A comprehensive look at LLM alignment techniques: RLHF, RLAIF, PPO, DPO... | Machine Heart\n\nThis article details various methods of large language model (LLM) alignment techniques, including reinforcement learning from human feedback (RLHF), reinforcement learning from AI feedback (RLAIF), PPO, DPO, etc.",
    "labels": [
      "LLM",
      "RLHF"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RLHF"
      ]
    ]
  },
  {
    "content": "Rohan Paul (@rohanpaul_ai) posted at 6:02 AM on Fri, Sep 13, 2024:\nCool visualization work by @ProfTomYeh 👏\n\nHow does OpenAI train the Strawberry🍓 (o1) model to spend more time thinking?",
    "labels": [
      "LLM",
      "RLHF"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RLHF"
      ]
    ]
  },
  {
    "content": "HeHe (@Ahhhnnn1234) posted at 5:01 PM on Mon, Dec 02, 2024:\n📸 Sharing a super practical screenshot plugin that I couldn't put down after being recommended: ShotEasy!\n\nScreenshot, annotation, adding background, and downloading, all done in one go! 😎\n\nCurrently, the background images and webpage screenshot needs of the tools included in my tool navigation site are almost all done by ShotEasy!\n\nHighly recommended for those who need it ✌️",
    "labels": [
      "tools"
    ],
    "label_paths": [
      [
        "tools"
      ]
    ]
  },
  {
    "content": "ruanyf (@ruanyf) posted at 5:19 PM on Thu, Dec 12, 2024: Which diagramming tool do you use? I prefer text-based diagramming tools like Mermaid, Plantuml, and Graphviz. They are convenient to include in code repositories for version control. Recently, I discovered a more user-friendly diagramming tool called D2, which is simple, intuitive, and powerful, and you can learn the basic syntax in just three minutes.",
    "labels": [
      "tools"
    ],
    "label_paths": [
      [
        "tools"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 5:41 PM on Sat, Nov 02, 2024:\nThe essence of data visualization:\nTransforming raw data (including quantitative, qualitative, geospatial, and temporal types) into intuitive and readable graphical representations through appropriate visual encoding methods (such as bars, lines, etc.), thanks to @rfeers for sharing,\nrecommend everyone to follow this blogger's data science sharing!\n\n※ Basic concepts of data:\n- Data (datum) is defined as the smallest unit of information or observation record",
    "labels": [
      "visualization"
    ],
    "label_paths": [
      [
        "visualization"
      ]
    ]
  },
  {
    "content": "A very good data visualization tool: JSON Crack\nSupports visualizing JSON, YAML, XML, CSV, etc., into interactive charts, suitable for analyzing complex data structures, developers, and data analysts.\n\n1. Supports visualizing JSON, YAML, XML, CSV, etc., into interactive graphics or tree structures.\n2. Supports data format conversion, such as JSON to CSV, YAML to JSON, etc.",
    "labels": [
      "visualization"
    ],
    "label_paths": [
      [
        "visualization"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 8:39 PM on Mon, Nov 04, 2024:\nDouble Release Day 🎉 Fish Audio team launches 👇👇\nFish Agent v0.1 + Fish Speech 1.4 Technical Report 🚀\n\n## Fish Agent ##\n\nCore new features:\n- True end-to-end architecture - no semantic layering\n- Zero-shot voice cloning\n- Compact 3B parameter size, easy to develop\n- Supports text and audio input\n- Super fast 200ms Time To First Audio (TTFA)",
    "labels": [
      "LLM",
      "TTS"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "TTS"
      ]
    ]
  },
  {
    "content": "Adina Yakup (@AdinaYakup) posted at 8:52 AM on Mon, Oct 14, 2024:\nF5-TTS 🔥 a fully non-autoregressive text-to-speech system based on flow matching with DiT, released by authors from Shanghai Jiao Tong University, @GeelyGroup and @Cambridge_Uni 🚀",
    "labels": [
      "LLM",
      "TTS"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "TTS"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:36 PM on Mon, Nov 11, 2024:\nAI Search Engine's New Journey: Perplexity CEO Deeply Deciphers the Growth Path Behind Billions of Weekly Queries\n\nAn important interview between Peter Yang (Product at Roblox) and Aravind Srinivas (CEO of Perplexity),\nlet's see how this rapidly popular AI search team achieved such success 👇👇\n\nProduct Development and Iteration:\n- The secret to Perplexity's rapid product development\n- CEO",
    "labels": [
      "podcast",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "podcast"
      ]
    ]
  },
  {
    "content": "AI at Meta (@AIatMeta) posted at 11:31 AM on Fri, Jun 28, 2024:\nNew video out today! Understanding the Meta Llama 3 Tokenizer with\n@astonzhangAZ from the Llama research team. This conversation dives into\nthe change from SentencePiece to Tiktoken and what that enables for our\nlatest models.",
    "labels": [
      "podcast",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "podcast"
      ]
    ]
  },
  {
    "content": "Read “Text Extraction Using Molmo AI: The Power of Molmo-7B for All Your Documents“ by Tarun Singh on Medium",
    "labels": [
      "LLM",
      "structured"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structured"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 2:57 PM on Tue, Aug 06, 2024:\nOpenAI's new models gpt-4o-2024-08-06 and gpt-4o-mini now support structured output, which is different from the previous JSON mode. The new structured output not only allows defining the JSON Schema (i.e., the structure of the JSON output) but also ensures that the output JSON is 100% correct.\n\nAt first glance, I didn't believe it, especially after seeing its JSON",
    "labels": [
      "LLM",
      "structured"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structured"
      ]
    ]
  },
  {
    "content": "Read “Choosing the Best Embedding Model For Your RAG Pipeline“ by Nilesh Raghuvanshi on Medium.",
    "labels": [
      "LLM",
      "embedding"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "embedding"
      ]
    ]
  },
  {
    "content": "Read “Optimizing RAG with Embedding Tuning“ by Sarayavalasaravikiran on Medium.",
    "labels": [
      "LLM",
      "embedding"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "embedding"
      ]
    ]
  },
  {
    "content": "𝘁𝗮𝗿𝗲𝘀𝗸𝘆 (@taresky) posted at 8:39 PM on Wed, Nov 13, 2024: #Crypto\n\n“The sUSDe distribution for this week is 29% APY”",
    "labels": [
      "bitcoin"
    ],
    "label_paths": [
      [
        "bitcoin"
      ]
    ]
  },
  {
    "content": "𝘁𝗮𝗿𝗲𝘀𝗸𝘆 (@taresky) posted at 7:36 PM on Tue, Nov 12, 2024: The article on Xiaohongshu survived for less than 12 hours 🤦",
    "labels": [
      "bitcoin"
    ],
    "label_paths": [
      [
        "bitcoin"
      ]
    ]
  },
  {
    "content": "Read “Will Long-Context LLMs Cause the Extinction of RAG“ by Florian June on Medium",
    "labels": [
      "LLM",
      "context"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "context"
      ]
    ]
  },
  {
    "content": "Quinn Leng (@quinn_leng) posted at 0:29 AM on Tue, Aug 13, 2024: Sharing my recent research findings at the company: 'Long Context RAG Performance of LLMs' (blog post ), which provides an in-depth analysis of the performance of the latest 13 mainstream models (GPT-4o/4o-mini, LLama3.1, Claude-3.5-sonnet, etc.) in long-context retrieval-augmented generation (RAG) tasks, revealing some very interesting phenomena:",
    "labels": [
      "LLM",
      "context"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "context"
      ]
    ]
  },
  {
    "content": "Read “Revolutionizing Chip Design with Generative AI: A New Era of Innovation and Efficiency“ by Nadeem Mustafa on Medium",
    "labels": [
      "LLM",
      "chipdesign"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "chipdesign"
      ]
    ]
  },
  {
    "content": "Read “AI driven chip design // AI for AI hardware design“ by sbagency on Medium:",
    "labels": [
      "LLM",
      "chipdesign"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "chipdesign"
      ]
    ]
  },
  {
    "content": "henu王凯 (@henuwangkai) posted at 10:59 PM on Sat, Jun 29, 2024: Looking at the overall situation of AI hardware, it is still in its infancy and accelerating.",
    "labels": [
      "IOT"
    ],
    "label_paths": [
      [
        "IOT"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 8:53 PM on Sun, May 12, 2024:\nA $20 AI glasses that can record your life, recognize names, count calories, perform real-time translation, and more, fully open source.",
    "labels": [
      "good_material",
      "IOT"
    ],
    "label_paths": [
      [
        "good_material"
      ],
      [
        "IOT"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 3:28 AM on Mon, Oct 14, 2024:\nFrom Fast Thinking to Deep Reasoning: The Next Leap in AI\nby @sonyatweetybird @gradypb and o1\n\nAn article from Sequoia delves into the latest developments in generative AI, particularly emphasizing the key trend of transitioning from mere pattern matching to true reasoning capabilities. As the foundational model market stabilizes,\ninnovation and opportunities are shifting to the application layer.\n\nThe article particularly highlights the importance of cognitive architecture,",
    "labels": [
      "knowledge"
    ],
    "label_paths": [
      [
        "knowledge"
      ]
    ]
  },
  {
    "content": "Xiao Hu (@imxiaohu) posted at 3:46 AM on Wed, Dec 04, 2024:\nA true AI search engine\n\nIt can fully understand your meaning and directly output the results you want.\n\nThe American startup Exa has released a preview version of their new AI search product, Exa WebSets.\n\nThis is a new search tool driven by a brand-new spatial search engine.\n\nTraditional search can only give you a bunch of related web pages, while Exa WebSets can understand your needs and directly provide you with organized results that meet the criteria.",
    "labels": [
      "knowledge"
    ],
    "label_paths": [
      [
        "knowledge"
      ]
    ]
  },
  {
    "content": "Read “Streamlit vs HTMX — LLM Streaming Chatbots“ by Preston Blackburn on Medium",
    "labels": [
      "LLM",
      "front-end"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "front-end"
      ]
    ]
  },
  {
    "content": "Read “Did Google Just Kill Streamlit?“ by Om Kamath on Medium",
    "labels": [
      "LLM",
      "front-end"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "front-end"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 6:13 PM on Tue, Nov 26, 2024:\nAnt Group has open-sourced a toolkit called Ant Design X that can quickly build AI chat interfaces. It can be used to quickly create professional dialogue interfaces similar to ChatGPT and can easily integrate AI models.\n\nNo need to write code from scratch; the interface design is already done and can be used directly.\nSupports custom styles.\n\nIt can be used in various applications that require AI dialogue, such as intelligent customer service systems, AI assistants, and intelligent Q&A systems.",
    "labels": [
      "LLM",
      "front-end"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "front-end"
      ]
    ]
  },
  {
    "content": "Y11 (@seclink) posted at 9:03 PM on Thu, Jun 06, 2024:\nSummarizing some past comments here, will continue to review and move them later:",
    "labels": [
      "startup"
    ],
    "label_paths": [
      [
        "startup"
      ]
    ]
  },
  {
    "content": "Guizang(guizang.ai) (@op7418) posted at 8:39 PM on Tue, Oct 15, 2024:\nAnother large financing in the AI field.\n\nDecagon AI, which provides AI Agents services for B-end enterprises, has secured $65 million in Series B funding.\n\nThe company's total financing has now reached $100 million.\n\nTheir website is also very nice, you can take a look.",
    "labels": [
      "startup"
    ],
    "label_paths": [
      [
        "startup"
      ]
    ]
  },
  {
    "content": "Zimu Talks About Going Global (@CoderJeffLee) posted at 2:54 AM on Thu, Jun 06, 2024: Top 500+ AI Tools Revenue List",
    "labels": [
      "startup"
    ],
    "label_paths": [
      [
        "startup"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 1:28 AM on Sun, Aug 11, 2024:\nI just discovered the best blog template! 🤯🤯\n\nReferencing the @tailwindcss Blog implementation, fully open source, 7K Star🌟\n\nBuilt with @nextjs, optimized for SEO, and fully customizable, up and running with custom styles in less than 10 minutes⚡️",
    "labels": [
      "blog site"
    ],
    "label_paths": [
      [
        "blog site"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 1:44 PM on Wed, Oct 02, 2024:\nMigrated the blog system to CloudFlare\n\nPreviously, my blog system was deployed on Vercel. The initial version was built on an MDX static file blog system, which worked well. However, as the content grew and traffic increased, some issues arose.\n\nThe main issue is MDX",
    "labels": [
      "blog site"
    ],
    "label_paths": [
      [
        "blog site"
      ]
    ]
  },
  {
    "content": "DeBill (@ljlvchris) posted at 2:26 AM on Sat, Aug 10, 2024:\nThe long-delayed introduction to the Cloudflare from beginner to master series has been released😜 First published on WeChat public account, and will be updated on my personal blog later.\n\nThis series currently plans to have more than ten articles, and there will be updates in the next one or two months. Welcome to follow my public account.\n\nps: The typesetting of WeChat public account articles is too hard😅",
    "labels": [
      "blog site"
    ],
    "label_paths": [
      [
        "blog site"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 8:51 PM on Sun, Jun 23, 2024:\nSummary of text 2 sql projects:\n1. Vanna:\nThe first open-source project for real-time visual training of Text2SQL, using RAG to train the model, enabling natural language to generate SQL statements and interact with structured data in databases.\n\n2. OpenAgents",
    "labels": [
      "LLM",
      "text2sql"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "text2sql"
      ]
    ]
  },
  {
    "content": "Tao Yu ✈️ NeurIPS 2024 (@taoyds) posted at 3:36 PM on Sun, Dec 08, 2024:\nText-to-SQL has been my passion since Yale Spider 1.0! But as LLMs master\nit, real-world complexity demands more.\n\n🚀After a year of work, Spider 2.0 shows the gap: o1 achieves just 17%!\n\nThe path to production deployment is still long but exciting!",
    "labels": [
      "LLM",
      "text2sql"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "text2sql"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 6:49 PM on Mon, Jun 17, 2024:\nNew generation BI platform: SuperSonic\nSuperSonic integrates Chat BI (powered by LLM) and Headless BI (powered by semantic layer), ensuring that Chat\nBI can access the unified governance semantic data model just like traditional BI\n\nThe integration of Chat BI and Headless BI has the potential to enhance Text2SQL capabilities in two aspects:…",
    "labels": [
      "LLM",
      "text2sql"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "text2sql"
      ]
    ]
  },
  {
    "content": "Today I watched a video explaining marketing strategies, and I think it was quite good. I summarized it and shared it with everyone:\n\nDo you feel the same way?\n\n1) Seven Exposures\n\nThis is something most people overlook but is very important. There is a marketing theory called the Rule of 7, which means you need to expose yourself and your product at least seven times to finally attract others' attention;",
    "labels": [
      "marketing"
    ],
    "label_paths": [
      [
        "marketing"
      ]
    ]
  },
  {
    "content": "dangjin (@JinsFavorites) posted at 8:25 PM on Tue, Sep 10, 2024:\nRecently, I got two great tools from the expert @ilovek8s:\n\nwappalyzer: Can analyze the tech stack of a site\n\naitdk: A free SEO analysis tool that can check site traffic, keywords, etc.\n\nAlso, sharing an AI Tools navigation site that includes many AI-based tools from abroad~",
    "labels": [
      "marketing",
      "product"
    ],
    "label_paths": [
      [
        "product"
      ],
      [
        "marketing"
      ]
    ]
  },
  {
    "content": "HongyuanCao (@HongyuanCao) posted at 7:11 AM on Sun, Sep 08, 2024:\nTop 5 Marketing Trends in 2024\n\n1. 🎥Short Videos: Short videos are great for marketing because they can quickly grab people's attention and generate more engagement. They can help brands reach a wider audience and share clear, creative messages.\n\n2. 👩‍💻 Influencer Marketing: Influencers are very popular on social media, so collaborating with them can be a great way to boost your brand if done well.",
    "labels": [
      "marketing"
    ],
    "label_paths": [
      [
        "marketing"
      ]
    ]
  },
  {
    "content": "Xiong Brown (@Stephen4171127) posted at 9:19 AM on Sun, Oct 27, 2024:\nMeta has released an open-source NotebookLM\nStep 1: Preprocess PDF. Use Llama-3.2-1B-Instruct to preprocess PDF and save it as a .txt file.\nStep 2: Script writing. Use Llama-3.1-70B-Instruct to write a podcast script from the text.\nStep 3: Dramatic rewriting. Use the Llama-3.1-8B-Instruct model to make the script more dramatic.",
    "labels": [
      "LLM",
      "NotebookLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "NotebookLM"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 7:18 PM on Mon, Dec 02, 2024:\nOllama will soon support structured output for LLM 🎉\n\nAt the @ollama meetup held at the @github office, @thanosthinking announced that Ollama will soon support structured output for LLM, as can be seen from the Github commit records 👇👇\n\n1. New features\n\n- Support for passing JSON schema and converting it into grammar rules for sampling\n- Balancing ease of use and functionality - by supporting JSON schema",
    "labels": [
      "LLM",
      "NotebookLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "NotebookLM"
      ]
    ]
  },
  {
    "content": "orange.ai (@oran_ge) posted at 5:02 PM on Fri, Dec 13, 2024:\nNotebookLM new version trial address:\n(\n)",
    "labels": [
      "LLM",
      "NotebookLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "NotebookLM"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 7:16 PM on Thu, Sep 26, 2024:\nGreat, NotebookLM has added support for audio and YouTube! This makes it much more convenient to use.\n\n1. Supports adding YouTube links and audio files to the notebook\n2. Improved the sharing function of Audio Overviews\n\nCan be used as\nVideo and lecture analysis assistant: Summarize key concepts and provide inline references\nAudio assistant: Allows NotebookLM to search for specific information in transcribed conversations",
    "labels": [
      "LLM",
      "NotebookLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "NotebookLM"
      ]
    ]
  },
  {
    "content": "elvis (@omarsar0) posted at 2:53 PM on Wed, Aug 07, 2024:\nMistral just announced easier ways to build custom LLMs.\n\nI already took it for a spin! Together with fine-tuning, I like how Agents make it easy to build efficient and custom LLMs.\n\nHere is the FULL video if you are interested:\n\nThe clip shows how to",
    "labels": [
      "LLM",
      "finetune"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "finetune"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 5:24 PM on Tue, Jul 30, 2024:\nThe best visual guide to the principles of large model/LLM quantization! 🤯🤯 Demonstrates and teaches various techniques through beautiful illustrations! Highly recommended! 🔥 You can deepen your understanding of Llama 3.1 after learning.\nFine-tuning👍\n\nIncludes technical details such as FP16, BF16, INT8, post-training quantization like GGUF, and 4Bit quantization. Quantization is becoming the most important technology for running/compressing LLMs on the edge!",
    "labels": [
      "LLM",
      "finetune"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "finetune"
      ]
    ]
  },
  {
    "content": "LLaMA Factory (@llamafactory_ai) posted at 10:42 AM on Sun, Sep 08, 2024:\nCongrats on 30k GitHub stars🎉We just released LLaMA-Factory v0.9.0:\n\n✨8 models: Qwen2-VL, Yi-Coder, etc\n📚4 datasets: RLHF-V, VLFeedback, etc\n🎨2 modalities: multi-images, videos\n🚀3 algorithms: Adam-mini, Liger Kernel, Unsloth GC\n🔗vLLM v0.6.0",
    "labels": [
      "LLM",
      "finetune"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "finetune"
      ]
    ]
  },
  {
    "content": "Guizang (guizang.ai) (@op7418) posted at 0:23 AM on Mon, Sep 09, 2024:\nMeta has published three articles detailing the training process and fine-tuning of LLMs.\n\nThe articles are very informative, covering key points of LLM fine-tuning, and are highly recommended. Below are the core notes.\n\n- LLM training methods\n- How to choose the appropriate training method\n- How to determine if LLM fine-tuning is needed\n- Preparation of LLM fine-tuning datasets\n- Data quality/quantity\n- Data diversity\n- How to build the data pipeline for LLMs",
    "labels": [
      "LLM",
      "finetune",
      "paper"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "paper"
      ],
      [
        "LLM",
        "finetune"
      ]
    ]
  },
  {
    "content": "Y11 (@seclink) posted at 3:54 AM on Mon, Nov 18, 2024:\nFound an interesting project called Wav2Lip, which can generate video effects synchronized with lip movements through audio input.\n\nThe project provides detailed code and implementation to help you understand step by step how to generate lip-synced videos.\n\nThe project includes:\n\n1. Input audio to generate lip-synced video synchronized with the audio\n2. Provides complete code and paper as reference\n3. Supports multiple video sources, with clear example effects",
    "labels": [
      "vision"
    ],
    "label_paths": [
      [
        "vision"
      ]
    ]
  },
  {
    "content": "Will (@FinanceYF5) posted at 1:15 AM on Wed, Dec 04, 2024:\nY Combinator: Why vertical AI agents could be 10 times larger than SaaS",
    "labels": [
      "vision"
    ],
    "label_paths": [
      [
        "vision"
      ]
    ]
  },
  {
    "content": "Uncle J (@JeffreyH630) posted at 5:04 AM on Wed, Dec 04, 2024: YC's judgment",
    "labels": [
      "vision"
    ],
    "label_paths": [
      [
        "vision"
      ]
    ]
  },
  {
    "content": "Gorden Sun (@Gorden_Sun) posted at 6:42 AM on Mon, Jul 01, 2024:\nRole-driven data synthesis method\nCollected 1 billion role settings through the network, and LLM generates synthetic data from the perspective of these roles.",
    "labels": [
      "dataset",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "dataset"
      ]
    ]
  },
  {
    "content": "Jiaxi Panda (@Jiaxi_Cui) posted at 5:02 AM on Fri, Jun 07, 2024:\nStill struggling with training large models for actual business scenarios? We have open-sourced this multi-domain Task dataset.\n\nFrom Data to AGI, data is an indispensable fuel. We firmly believe that for individuals and organizations, excessively pursuing more general-purpose foundational large models is meaningless. Only by creating a series of sub-task datasets tailored to one's own scenarios and performing Task Fine Tuning can LLMs be better implemented.",
    "labels": [
      "dataset",
      "LLM",
      "good_material"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "good_material"
      ],
      [
        "LLM",
        "dataset"
      ]
    ]
  },
  {
    "content": "elvis (@omarsar0) posted at 10:16 AM on Fri, Jun 28, 2024:\nImproving Retrieval in LLMs by Finetuning on Synthetic Data\n\nProposes a fine-tuning approach to improve the accuracy of retrieving information in LLMs while maintaining reasoning capabilities over long-context inputs.\n\nThe fine-tuning dataset comprises numerical dictionary",
    "labels": [
      "dataset",
      "LLM",
      "paper"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "paper"
      ],
      [
        "LLM",
        "dataset"
      ]
    ]
  },
  {
    "content": "Ni Shuang (@nishuang) posted at 5:47 PM on Sun, Aug 11, 2024:\nIndeed, there are people who truly love learning everywhere. This person tinkers at home every day and has documented the process into a series of tutorials called 'Home Data Center.' The thinking is very clear, and the writing is also very clear👏\n\nHis solution is to use a home server as the main server and VPS for disaster recovery... This breaks my mental stereotype, which is one of the reasons I spend my days learning seemingly useless knowledge.",
    "labels": [
      "dataset",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "dataset"
      ]
    ]
  },
  {
    "content": "Tony出海号 (@tonyzhu1984) posted at 8:54 AM on Fri, Nov 01, 2024:\nFuck, is Zuckerberg a Chinese spy? Meta announced the open-source of three latest cutting-edge technologies in robotics and tactile perception.\n\n1️⃣ Meta Sparsh is the first universal encoder for vision-based tactile sensing, suitable for various tactile sensors and multiple tasks. It is trained on 460K+ tactile images using self-supervised learning.\n2️⃣ Meta Digit 360",
    "labels": [
      "LLM",
      "robot"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "robot"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 5:56 PM on Thu, Oct 24, 2024:\nZhi Hui Jun has open-sourced his Zhiyuan Robot Lingxi X1, including full set of drawings + code 👍, resources are as follows:\n\nThe Lingxi X1 whole machine structure, the whole body contains 29 joints (R86-2*9, R86-3*6, R52*10, L28*4) and 2 grippers, supports the expansion of 3 degrees of freedom in the head\n\nHeight 133 cm, weight about 33 kg, modular design, can be easily disassembled and assembled through a simple hoop form, can adapt to a variety of application scenarios",
    "labels": [
      "LLM",
      "robot"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "robot"
      ]
    ]
  },
  {
    "content": "Sophia Yang, Ph.D. (@sophiamyang) posted at 7:59 AM on Mon, Nov 04, 2024:\nTrain robots with videos using @MistralAI Pixtral!\n\nThis cool project recorded humans performing tasks and used Pixtral to translate the videos into robot commands, allowing the robot to replicate the tasks.",
    "labels": [
      "LLM",
      "robot"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "robot"
      ]
    ]
  },
  {
    "content": "AI at Meta (@AIatMeta) posted at 9:08 AM on Thu, Oct 31, 2024:\nToday at Meta FAIR we’re announcing three new cutting-edge developments in robotics and touch perception — and releasing a collection of artifacts to empower the community to build on this work.",
    "labels": [
      "LLM",
      "robot"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "robot"
      ]
    ]
  },
  {
    "content": "小互 (@imxiaohu) posted at 9:03 PM on Thu, Aug 15, 2024:\nBrothers, this is awesome 👍🏻\n\nUpstash Vector: Indexed 11 million Wikipedia articles into 144 million vector data, supporting 11 languages including Chinese.\n\nYou can use it to easily build search engines and RAG bots.\n\nUpstash Vector, a vector database that supports scalable similarity search, has vectorized the entire Wikipedia articles.",
    "labels": [
      "corpus"
    ],
    "label_paths": [
      [
        "corpus"
      ]
    ]
  },
  {
    "content": "Lucy's Treasure Box (@Lucy_love_AI) posted at 11:54 PM on Fri, Sep 27, 2024:\nAlthough the horizon has closed, true knowledge will always be passed on!\n\nExclusive compilation of the complete collection of Tianya divine posts in PDF format, gathering 350 classic contents, enough to read at once!",
    "labels": [
      "corpus"
    ],
    "label_paths": [
      [
        "corpus"
      ]
    ]
  },
  {
    "content": "Zhi Jian AI (@shadouyoua) posted at 10:30 PM on Fri, Aug 16, 2024: The most comprehensive collection of Tianya divine posts, approximately 600+ articles in PDF format",
    "labels": [
      "corpus"
    ],
    "label_paths": [
      [
        "corpus"
      ]
    ]
  },
  {
    "content": "Gorden Sun (@Gorden_Sun) posted at 7:39 AM on Sun, Aug 11, 2024:\nMedTrinity-25M: A medical multimodal dataset\nContains 25 million medical images with detailed annotations, which can be used to train large medical multimodal models.",
    "labels": [
      "corpus"
    ],
    "label_paths": [
      [
        "corpus"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 9:52 PM on Mon, Jul 29, 2024: Meta has released the next-generation video and image segmentation model SAM 2 (Segment Anything Model 2). Compared to the first-generation image segmentation model, SAM 2 is a unified model that can achieve real-time prompt object segmentation in images and videos, reaching state-of-the-art performance. Meta will share the code and model weight files under the Apache 2.0 license, and will also share the SA-V dataset, which includes approximately 51,000",
    "labels": [
      "CV"
    ],
    "label_paths": [
      [
        "CV"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 5:48 PM on Sun, Jun 16, 2024:\nAndrew Ng showcased the code and prompts for 'Vision Agent' developed by his team at the Snowflake AI Summit 2024.\nIt has been open-sourced and is highly worth learning🔥🚀\n\nVA is based on the Agentic Workflow of CodeInterpreter: combining 7 Agents to solve complex computer vision problems, generally outperforming\nZero-shot LLM, inspired by 2 classic papers",
    "labels": [
      "CV"
    ],
    "label_paths": [
      [
        "CV"
      ]
    ]
  },
  {
    "content": "Read “CVPR 2024: Top Highlights You Must Know— Embodied AI, GenAI, Foundation Models, and Video…“ by The Tenyks Blogger on Medium.",
    "labels": [
      "CV"
    ],
    "label_paths": [
      [
        "CV"
      ]
    ]
  },
  {
    "content": "Susan/STEM MOM (@feltanimalworld) posted at 6:30 PM on Tue, Dec 03, 2024: I usually buy second-hand books. I go to this… sometimes I can find very cheap good books. The physical books I buy are classic collections, actually quite few. This website also allows you to follow the books you want to buy, and if they are temporarily unavailable, it will notify you by email when they are available.",
    "labels": [
      "book"
    ],
    "label_paths": [
      [
        "book"
      ]
    ]
  },
  {
    "content": "Xiangyang Qiaomu (@vista8) posted at 7:20 AM on Mon, Oct 21, 2024:\nRead one-third, some excerpts:\n\n- The people you can help are your network.\n\n- People can only establish relationships with those who have a need for them.\n\n- Product value = functional value + emotional value + asset value.\n\n- Functional value meets basic needs and efficiency needs.\n\n- There are 4 models of functional value: raw materials/labor model, patent/IP model, platform/supply chain model, infrastructure model.\n\n-",
    "labels": [
      "book"
    ],
    "label_paths": [
      [
        "book"
      ]
    ]
  },
  {
    "content": "Xiaojing Canxue (@xiaojingcanxue) posted at 5:38 PM on Mon, Oct 14, 2024: Daron, the author of 'Why Nations Fail,' has won the Nobel Prize in Economics. The simplified Chinese version of this book has been abridged.",
    "labels": [
      "book"
    ],
    "label_paths": [
      [
        "book"
      ]
    ]
  },
  {
    "content": "Huang Yun (@huangyun_122) posted at 10:59 PM on Sun, Oct 27, 2024: Professor Andrew Ng's new book 'How to Build Your Career in AI'",
    "labels": [
      "book"
    ],
    "label_paths": [
      [
        "book"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 3:17 PM on Fri, Jun 14, 2024:\nNVIDIA has released an open-source synthetic data generation pipeline for training large language models.\n\nNemotron-4 340B, a model family optimized for NVIDIA NeMo and NVIDIA\nTensorRT-LLM, includes state-of-the-art instruction models and reward models, as well as datasets for generative AI training.\n\nNVIDIA announced the launch of Nemotron-4 today…",
    "labels": [
      "LLM",
      "new-model"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "new-model"
      ]
    ]
  },
  {
    "content": "Gorden Sun (@Gorden_Sun) posted at 9:08 AM on Thu, Jun 27, 2024:\nGoogle has open-sourced Gemma 2\nTwo sizes, 9B and 27B, where the 9B model significantly outperforms LLaMA 3 8B; the 27B model is weaker than LLaMA 3 70B but stronger than Qwen 1.5 32B.",
    "labels": [
      "LLM",
      "new-model"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "new-model"
      ]
    ]
  },
  {
    "content": "Zhong Erxin (@zhongerxin) posted at 11:25 PM on Sat, Jun 15, 2024:\nThis week, the desktop version of Doubao launched the \"AI Enhanced Writing\" Beta version:\n\n1. In Word or Notepad, you can activate \"Help Me Write\" and \"Write and Compile\" to assist in content creation.\n2. Since it's a Beta version, some areas are not yet ready, so you need to enable \"AI Writing\" in the settings first to use it.\n\nSo, friends who want to try it out, hurry up and give it a try:",
    "labels": [
      "LLM",
      "new-model"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "new-model"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 6:47 PM on Thu, Jun 27, 2024:\nOpenAI has launched the CriticGPT model!\nCriticGPT is a model based on GPT-4, designed to identify errors in GPT-4 code, reduce hallucinations, and explain where the content is wrong.",
    "labels": [
      "LLM",
      "new-model"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "new-model"
      ]
    ]
  },
  {
    "content": "Read “NVIDIA (Hopper) H100 Tensor Core GPU Architecture“ by Dr. Nimrita Koul on Medium.",
    "labels": [
      "CUDA"
    ],
    "label_paths": [
      [
        "CUDA"
      ]
    ]
  },
  {
    "content": "Georgi Gerganov (@ggerganov) posted at 3:37 AM on Thu, Aug 08, 2024:\nAlan Gray (NVIDIA) writes about implementing CUDA graphs in llama.cpp.",
    "labels": [
      "CUDA"
    ],
    "label_paths": [
      [
        "CUDA"
      ]
    ]
  },
  {
    "content": "Stanford University's Hazy Lab has released an embedded DSL called ThunderKittens, which makes it easier to write high-performance CUDA kernels and fully utilize the features of the H100. Using ThunderKittens, the Flash Attention algorithm can be implemented in about 60 lines of code, achieving 75% hardware utilization. In the future, ThunderKittens will also support other hardware platforms such as AMD.",
    "labels": [
      "CUDA"
    ],
    "label_paths": [
      [
        "CUDA"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 9:25 AM on Sun, Aug 18, 2024:\nThis open-source \"ALIEN - Artificial Life Simulation Program\" implemented with CUDA and with 3.9K stars is so cool⚡️🔥\n\nIt includes physics and graphics engines, artificial life engine extensions, and implements plant populations, cell networks, and genome editors🤯",
    "labels": [
      "CUDA"
    ],
    "label_paths": [
      [
        "CUDA"
      ]
    ]
  },
  {
    "content": "Low Life (@didengshengwu) posted at 3:47 AM on Sat, Aug 03, 2024: These behaviors are killers of intimate relationships",
    "labels": [
      "reading"
    ],
    "label_paths": [
      [
        "reading"
      ]
    ]
  },
  {
    "content": "Read “The Death of SaaS“ by Aki Ranin on Medium.",
    "labels": [
      "reading"
    ],
    "label_paths": [
      [
        "reading"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 8:49 AM on Sat, Aug 17, 2024:\nYC President @garrytan pointed out that the views of former Google CEO Eric Schmidt are correct, and this is currently happening in companies invested by YC! ⚡️🤯\n\nThese core points are also very good, highly recommended for those interested in AI to read.\n\nAI programmer example.\n\nCore points.",
    "labels": [
      "reading"
    ],
    "label_paths": [
      [
        "reading"
      ]
    ]
  },
  {
    "content": "Shaoping (@shaoping2022) posted at 2:52 AM on Tue, Jun 18, 2024: The ultra-detailed interpretation of 'Beyond a Hundred Years' has been recorded. Pure sharing, not a professional storyteller, welcome to critique.",
    "labels": [
      "reading"
    ],
    "label_paths": [
      [
        "reading"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 7:32 AM on Sun, Nov 03, 2024:\nSuper audio and video download tool yt-dlp, extracts video resources from the entire network | Covers thousands of platforms including YouTube/Tiltok/Bilibili/Douyin/Ins (86.8k⭐)\nCommand line management • Batch download • Proxy support • Format conversion\n\nCore features:\n- Supports audio and video downloads from thousands of websites\n- Provides rich command line options\n- Supports various video/audio processing formats\n- Features geo-restriction bypass",
    "labels": [
      "research-tool"
    ],
    "label_paths": [
      [
        "research-tool"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 8:10 PM on Fri, Jul 26, 2024:\nA very convenient database design tool: DrawDB\n\nDrawDB provides a visual interface that allows you to create/edit database diagrams online. It can automatically generate SQL scripts based on the diagrams, making it easy to create and manage databases even without coding knowledge.\n\nFeatures:\n1. Database Entity Relationship (DBER) Editor: Supports building database diagrams with simple clicks.\n2. SQL Generator:",
    "labels": [
      "research-tool"
    ],
    "label_paths": [
      [
        "research-tool"
      ]
    ]
  },
  {
    "content": "Knowledge Sharing Officer (@knowledgefxg) posted at 7:45 AM on Sun, Oct 13, 2024:\nWeekly GitHub Picks:\nThose useful open-source download tools⬇️\n\nMotrix\n\nqBittorrent\n\naria2\n\nXDM\n\nab-download-manager\n\n(\n)",
    "labels": [
      "research-tool"
    ],
    "label_paths": [
      [
        "research-tool"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 8:53 AM on Sun, Aug 11, 2024:\nThe article 'How Do I Use AI?' by Nicholas Carlini, a senior researcher at Google DeepMind, is fantastic! 🔥⚡️\n\nIt introduces 50 conversational forms that can 'increase work efficiency by 10-100 times' 🤯🤯\n\nAlthough AI cannot replace his expertise, it has changed the way he spends his time!\n\nHighly recommended! 👉",
    "labels": [
      "research-tool"
    ],
    "label_paths": [
      [
        "research-tool"
      ]
    ]
  },
  {
    "content": "36氪NEXT (@36krNEXT) posted at 1:07 AM on Sat, Dec 26, 2015: SimpleDiagrams: Quickly create hand-drawn style flowcharts, brainstorming, and other creative thinking diagrams",
    "labels": [
      "tips"
    ],
    "label_paths": [
      [
        "tips"
      ]
    ]
  },
  {
    "content": "Baoyu (@dotey) posted at 8:48 AM on Thu, Jun 13, 2024:\nA new GPT usage discovered: generating URL slugs for blog posts.\n\nPrompt:\nPlease generate an English URL slug for this blog title, clearly conveying the meaning of the original title. Here is the title:\n<title>",
    "labels": [
      "tips"
    ],
    "label_paths": [
      [
        "tips"
      ]
    ]
  },
  {
    "content": "Dawei Ma (@madawei2699) posted at 3:18 AM on Sat, Jul 03, 2021:\nExcalidraw：\n(\n)",
    "labels": [
      "tips"
    ],
    "label_paths": [
      [
        "tips"
      ]
    ]
  },
  {
    "content": "Michael Anti (@mranti) posted at 10:26 PM on Thu, Nov 28, 2024: Can anyone tell me how to permanently block 'CSDN Blog' results from appearing on Google search pages? I'm really fed up with it.",
    "labels": [
      "tips"
    ],
    "label_paths": [
      [
        "tips"
      ]
    ]
  },
  {
    "content": "Read “Phi-3 and Azure: PDF Data Extraction | ExtractThinker“ by Júlio Almeida on Medium",
    "labels": [
      "LLM",
      "structure-output"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structure-output"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 8:59 AM on Wed, Sep 11, 2024:\nIs the 0.5B model close to GPT-4o? AI Markdown explosive model update! 💥 @JinaAI_ announced the launch of 0.5B and 1.5B models specifically designed for cleaning web data into Markdown! 🔥\n\nDesigned for LLM processing of web data! Proprietary models inspired by the open-source Reader API, balancing cost, speed, and performance!\n\nTry it now 👉",
    "labels": [
      "LLM",
      "structure-output"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structure-output"
      ]
    ]
  },
  {
    "content": "A tool for extracting structured data from unstructured documents: DocAI\n\nBased on Byaldi, OpenAI's gpt-4o, and Langchain for structured data output\n\nSupports extracting structured information from unstructured documents such as PDFs, including loss history, basic application information, etc.\n\n#AI data extraction #data structuring",
    "labels": [
      "LLM",
      "structure-output"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structure-output"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 5:54 PM on Fri, Nov 01, 2024:\nStructured Output: A New Paradigm for Building Reliable AI Applications\n\nAn article from @weights_biases demonstrates how structured output can help developers build more reliable and maintainable AI applications.\n\n※ The Concept and Importance of Structured Output:\n- Structured output refers to data generated by AI models that conforms to predefined schemas\n- This ensures that the generated information is consistent and easily usable by various systems",
    "labels": [
      "LLM",
      "structure-output"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "structure-output"
      ]
    ]
  },
  {
    "content": "Multi-agent AI Hedge Fund - An open-source automated trading system\n\n「This Python open-source project uses four professional AI agents (market data, quantitative analysis, risk management, portfolio management) to work together, automating the entire process from data collection and analysis to trading decisions, enabling ordinary developers to build their own algorithmic trading systems.」\n\nMulti-agent collaboration architecture:",
    "labels": [
      "Fintech"
    ],
    "label_paths": [
      [
        "Fintech"
      ]
    ]
  },
  {
    "content": "Jeff Li (@jefflijun) posted at 6:02 AM on Mon, Sep 16, 2024:\nYesterday, Li Lu's 'few common sense' points were circulating on X, and I’ll highlight the key points for everyone:\n- The market economy is the cause, and modern technology is the result. Without a modern market economy, modern technology would not emerge.\n\n- All advanced technologies are created by private enterprises in a market economy environment... Government-led advanced technological innovations, if they disrupt market mechanisms, have no successful cases.",
    "labels": [
      "Fintech"
    ],
    "label_paths": [
      [
        "Fintech"
      ]
    ]
  },
  {
    "content": "Jeff Li (@jefflijun) posted at 3:43 PM on Wed, Sep 25, 2024:\nMicron Technology's first fiscal quarter revenue was approximately $8.7 billion, exceeding expectations. HBM (High Bandwidth Memory) is an important memory component that works in conjunction with chips like NVIDIA, creating a lucrative new revenue stream for Micron.\n\nDemand has consistently exceeded supply, allowing Micron to raise prices and secure long-term guaranteed contracts. The company stated that its products for 2024 and 2025 are already sold out.",
    "labels": [
      "Fintech"
    ],
    "label_paths": [
      [
        "Fintech"
      ]
    ]
  },
  {
    "content": "Xu Laomao (@raycat2021) posted at 6:05 AM on Fri, Sep 13, 2024:\nA better way to earn alpha is through quantitative investment. Here are 5 introductory books on quantitative investment. If you have already opened an account but feel confused and uncertain about the US stock market, please pay close attention to the method of quantitative investment. These books can broaden your perspective.\n\n1, \"Opening the Black Box of Quantitative Investment\"",
    "labels": [
      "Fintech"
    ],
    "label_paths": [
      [
        "Fintech"
      ]
    ]
  },
  {
    "content": "Simon (@YRSM_Simon) posted at 6:23 PM on Sat, May 11, 2024:\nThis week, we continue to evaluate the accuracy of various AI search products.\n\nThis evaluation focuses on the performance of each product in 'complex queries,' which are multi-entity or multi-objective queries in a multilingual environment. For example,\n\n- How much did Taiwan's GDP increase in 2022 compared to 2012 in US dollars?\n- Which movie is longer, Hamlet or Gone with the Wind",
    "labels": [
      "RAG",
      "LLM",
      "evaluation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "evaluation"
      ]
    ]
  },
  {
    "content": "orange.ai (@oran_ge) posted at 6:42 AM on Sun, Sep 15, 2024:\nThe debate between RAG and Long Context has finally reached a quantified conclusion:\n\nIn Defense of RAG in the Era of Long-Context Language Models",
    "labels": [
      "RAG",
      "LLM",
      "evaluation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "evaluation"
      ]
    ]
  },
  {
    "content": "LangChain (@LangChainAI) posted at 11:18 AM on Tue, Jun 18, 2024:\nAgent evaluations 🤖: Evaluating an agent's end-to-end performance\n\nProductionizing LLM-powered automated agents is challenging. With improved tool-calling LLMs and agent orchestration tools, developers need systematic ways to evaluate agent performance.\nWe've added a tutorial,…",
    "labels": [
      "RAG",
      "LLM",
      "evaluation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "evaluation"
      ]
    ]
  },
  {
    "content": "Kalyan KS (@kalyan_kpl) posted at 9:47 AM on Fri, Aug 16, 2024:\nRAGChecker - Diagnosing RAG Systems\n\nRAGChecker Framework\n\nRAGChecker is a fine-grained evaluation framework for Retrieval-Augmented Generation (RAG) systems.\n\nThis framework includes diagnostic metrics for both retrieval and generation modules.\n\nImproved Evaluation Accuracy",
    "labels": [
      "RAG",
      "LLM",
      "evaluation"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "evaluation"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:13 AM on Sat, Nov 02, 2024:\nOmniParser Gradio Demo\n\nMicrosoft's open-source image parsing project OmniParser's @Gradio Demo, accessible online via HF Spaces, by @jadechoghari\n\nOpen-source project:",
    "labels": [
      "LLM",
      "website-agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "website-agent"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 1:40 AM on Sat, Nov 02, 2024:\nMaxun - Web Data Collection Automation Platform @maxun_io\nWeb Scraping • No Code • Intelligent • Fully Automated\n\nNo-code web data extraction platform, users can train a web scraping bot in 2 minutes, achieve automated web data extraction without programming knowledge, supports converting websites to APIs\nor directly exporting to spreadsheets.\n\n✨Main Features:\n- No-code data extraction",
    "labels": [
      "LLM",
      "website-agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "website-agent"
      ]
    ]
  },
  {
    "content": "idoubi (@idoubicc) posted at 11:55 PM on Tue, Nov 12, 2024:\nThe article summary feature of the Zhile Reading Group has been restored. It was a bumpy road, but worth documenting.\n\n1. The WeChat bot uses the wechaty framework. Previously, it used the padlocal protocol, which cost 200 yuan/month. Now it has switched to the wechat4u protocol, which is free to use.\n\nThe padlocal protocol has the advantage of returning a stable user ID after re-login, while the wechat4u protocol does not.",
    "labels": [
      "LLM",
      "website-agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "website-agent"
      ]
    ]
  },
  {
    "content": "Luyu Zhang (@goocarlos) posted at 11:16 PM on Fri, Jun 14, 2024:\nToday, Dify has updated two important capabilities:\n1. RAG now supports content scraping from web pages, a capability completed in collaboration with Firecrawl;\n2. We have added a new Note node in Workflow, which is beneficial for creators to annotate and share the design ideas of the workflow with others.\n\nAt the same time, we are pleased to see that the number of contributors on GitHub has reached 256…",
    "labels": [
      "LLM",
      "website-agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "website-agent"
      ]
    ]
  },
  {
    "content": "Yufan Sheng (@amehochan) posted at 6:34 AM on Sun, Aug 11, 2024: While reading the rearranged 'Beijing No. 4 High School Teaching Materials - Trigonometry' by a master, I found a small error and corrected it for the master.",
    "labels": [
      "LLM",
      "tutorial"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "tutorial"
      ]
    ]
  },
  {
    "content": "Tom Dörr (@tom_doerr) posted at 10:55 AM on Tue, Oct 29, 2024: Anthropic published a repo with courses on how to use LLMs",
    "labels": [
      "LLM",
      "tutorial"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "tutorial"
      ]
    ]
  },
  {
    "content": "Tw93 (@HiTw93) posted at 3:53 PM on Mon, Nov 18, 2024: #EngineerLearning This 'Wang Huiwen Tsinghua Product Course' is worth reading, especially suitable for products or engineers who want to understand business logic.",
    "labels": [
      "LLM",
      "tutorial"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "tutorial"
      ]
    ]
  },
  {
    "content": "From @Google Gemini Code Assistant and Gemini! First-line engineer @pvergadia takes you through \"Mastering GenAI in Ten Days\"🔥\n\nLearn GenAI/LLM principles, Prompt Engineering, RAG, fine-tuning, RAG vs. fine-tuning, understanding AI Embedding, vector databases, and how to build end-to-end AI applications!",
    "labels": [
      "LLM",
      "tutorial"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "tutorial"
      ]
    ]
  },
  {
    "content": "Dr. Chris Cai (@caiziboshi) posted at 4:51 PM on Wed, Sep 11, 2024: After two years of catching up, why is there still a gap of two to three generations between Chinese and American AI? What does two to three generations mean?",
    "labels": [
      "funny",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "funny"
      ]
    ]
  },
  {
    "content": "Blind Gamer (@Blind___Gamer) posted at 10:00 PM on Mon, Nov 11, 2024:\nOriginal author: Thank you Tesla for saving my life. I was driving at 120 km/h on the ring expressway.\nI don't know why the car in front changed lanes so late 😵 Before I could react, the car's active safety system intervened, and the whole process was very smooth. At such a high speed, there was no rollover, and luckily, there were no cars in the adjacent lane 😬\nAt this moment, the $25,000 car was worth $24,000\nMy next car will still be a Tesla 🚗",
    "labels": [
      "funny",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "funny"
      ]
    ]
  },
  {
    "content": "Wesley (@imwsl90) posted at 5:11 AM on Sat, Nov 16, 2024:\nWhat is MVP? This is it!!\n\n“Get it running first, then optimize, then scale, and continue optimizing...”\n\nSome people say this is a makeshift team, but I think it’s genius. Those who call it a makeshift team have no idea how many resources it takes to develop a machine with touchscreen printing functionality.",
    "labels": [
      "funny",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "funny"
      ]
    ]
  },
  {
    "content": "Justin (@interjc) posted at 7:25 PM on Sat, Jun 22, 2024:\nThere are two things that should not be thrown around carelessly because they might damage the Earth, they are:\n\nIBM computers, Nokia phones",
    "labels": [
      "funny",
      "LLM"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "funny"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 3:02 AM on Wed, Aug 07, 2024:\nSummary of excellent papers on Prompt technology—Prompt Report🔥🤯\n\n- 58 pure text prompt techniques, including zero-shot, few-shot, thought generation, self-criticism, and decomposition techniques. Few-shot CoT works best\n\n- Prompt engineering: meta-prompt,\n- Answer engineering: answer shape, etc.\n- Agents: tool use, code, RAG\n- Safety: Prompt injection\n- Alignment",
    "labels": [
      "LLM",
      "prompt"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "prompt"
      ]
    ]
  },
  {
    "content": "Sophia Yang, Ph.D. (@sophiamyang) posted at 0:46 PM on Thu, Jun 13, 2024:\nGreat paper summarizing the prompt techniques - The Prompt Report.\n\n- 58 text-only prompting techniques including zero-shot, few-shot, thought generation, ensembling, self-criticism, and decomposition techniques.\nFew-shot CoT performs the best among the few techniques they…",
    "labels": [
      "LLM",
      "prompt"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "prompt"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 0:16 AM on Thu, Nov 14, 2024:\nThe secret to getting Claude to write better code: Detailed explanation of KISS/YAGNI/SOLID principles\n\n// By incorporating the KISS (Keep It Simple), YAGNI (You Aren't Gonna Need It), and SOLID (five principles of object-oriented design) programming principles into the prompts, Claude can generate more concise, practical, and high-quality code, avoiding over-engineering and unnecessary features.\n\n// KISS Principle (Keep It Simple Principle)\n- Encourage Claude",
    "labels": [
      "LLM",
      "prompt"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "prompt"
      ]
    ]
  },
  {
    "content": "Justin (@interjc) posted at 0:48 AM on Wed, Jun 26, 2024:\nThe Prompt library provided by Anthropic is quite comprehensive and can be considered a ready-made textbook for learning to use prompts.",
    "labels": [
      "LLM",
      "prompt"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "prompt"
      ]
    ]
  },
  {
    "content": "DeepSeek (@deepseek_ai) posted at 4:22 AM on Fri, Dec 13, 2024:\n🎉 DeepSeek-VL2 is here! Our next-gen vision-language model enters the MoE era.\n\n🤖 DeepSeek-MoE arch + dynamic image tilling\n⚡ 3B/16B/27B sizes for flexible use\n🏆 Outstanding performance across all benchmarks",
    "labels": [
      "LLM",
      "multimodal"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "multimodal"
      ]
    ]
  },
  {
    "content": "Guizang (guizang.ai) (@op7418) posted at 8:16 AM on Wed, Oct 30, 2024:\nGoogle has finally revealed the audio technology details they used to generate the NotebookLM podcast.\n\nIt mainly includes two parts:\n\nSoundStream is a neural audio codec that can efficiently compress and decompress audio input without affecting its quality.\n\nDuring the training process, SoundStream can learn attributes such as rhythm and timbre.\n\nAudioLM",
    "labels": [
      "LLM",
      "multimodal"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "multimodal"
      ]
    ]
  },
  {
    "content": "Mistral AI has released a new model: pixtral-12b-240910, which excels in recognizing complex handwritten notes, mathematical formulas, and charts.\n\nWith 12B parameters, it integrates language and visual capabilities, capable of understanding images, text, and URLs, and can perform tasks such as image description, Q&A, and code generation.\n\nIt supports input of images, text, and URLs, and can handle complex tasks involving images and text.",
    "labels": [
      "LLM",
      "multimodal"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "multimodal"
      ]
    ]
  },
  {
    "content": "The new interactive voice model LSLM, developed by the LANCE Lab at Shanghai Jiao Tong University and ByteDance, enables the model to listen and speak simultaneously! The effect is very good, close to the natural way of human conversation.\n\nLSLM addresses the limitations of existing voice models in real-time interaction, noise resistance, and recognition of unknown speakers, making it closer to the natural way of human conversation.\n\nLSLM adopts an end-to-end design, including both auditory and vocal channels, using a decoder-only TTS.",
    "labels": [
      "LLM",
      "multimodal"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "multimodal"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 3:48 AM on Tue, Jul 23, 2024:\nA flexible and easy-to-use LLM routing framework: RouteLLM\nRouteLLM addresses the issue of high-performance but expensive large models versus cheap but weak models. It dynamically selects stronger or weaker LLMs during inference, reducing costs without compromising quality.\n\nOn the MT Bench benchmark, costs are reduced by 85%, while achieving 95% of GPT-4's performance.\n\nFeatures:\n1. Replacement for OpenAI",
    "labels": [
      "LLM",
      "agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "agent"
      ]
    ]
  },
  {
    "content": "Michael Ryan (@michaelryan207) posted at 8:34 AM on Tue, Dec 10, 2024:\nVisualize your Language Program Optimization with @_rchaves_’s LangWatch!\nSuper cool interface for viewing and optimizing Language Programs with\n#DSPy!\nMIPROv2 makes an appearance in the launch video 👀",
    "labels": [
      "LLM",
      "agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "agent"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 3:22 AM on Mon, Oct 21, 2024: From Novice to Expert: 12 Steps to Master AI Agent Development The article provides a comprehensive learning path for AI Agent, covering 12 key steps from the basics of generative AI to advanced Agentic RAG systems. It offers readers theoretical knowledge and practical guidance, including programming basics, large language models, prompt engineering, the use of various frameworks, and practical development experience from no-code tools to Python programming 👇👇👇",
    "labels": [
      "LLM",
      "agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "agent"
      ]
    ]
  },
  {
    "content": "Tom Dörr (@tom_doerr) posted at 11:09 AM on Wed, Dec 11, 2024:\nWren AI is an open-source SQL AI agent that converts natural language questions into SQL queries, integrates with various databases and LLMs, and provides a user interface for data analysis and query generation.",
    "labels": [
      "LLM",
      "agent"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "agent"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 5:02 AM on Wed, Dec 04, 2024:\nExposure strategies to enhance personal influence\n\n「Expand personal influence through continuous content creation, technical sharing, and social activities, so that opportunities come to you」\n\n「The author's main points can be divided into several key areas」\n\nContent creation:\n- Writing (blogs, newsletters) is the most basic way to showcase\n- Video content (YouTube) can provide a more intuitive display\n- Building a personal website as a showcase platform\n\nProfessional achievements:",
    "labels": [
      "life"
    ],
    "label_paths": [
      [
        "life"
      ]
    ]
  },
  {
    "content": "Iron Hand (@0427SMtieshou) posted at 4:29 PM on Wed, Nov 13, 2024: 50 ways to kill procrastination",
    "labels": [
      "life"
    ],
    "label_paths": [
      [
        "life"
      ]
    ]
  },
  {
    "content": "Teacher Zeng (@wuhanomad) posted at 1:04 AM on Tue, Nov 12, 2024:\nThe animalistic nature of men and women is essentially the same; there is no love, but rather, 'whoever feeds them is their mother,' meaning whoever treats them well, cares for them, and is considerate of them, they will like and follow.\n\nTo acknowledge and respect this reality of animalistic nature, ordinary people need to do two things:\n1. Enhance their own value so that someone will love them.\n2. Prevent someone from pretending to love them in order to exploit their value.",
    "labels": [
      "life"
    ],
    "label_paths": [
      [
        "life"
      ]
    ]
  },
  {
    "content": "Gefei (@gefei55) posted at 1:22 AM on Tue, May 28, 2024: An overseas SEO enthusiast wrote a blog discussing the leak of Google's ranking algorithm documents and provided some interpretations. The original text is here. This blog is quite long, and after a quick glance, it doesn't differ much from the SEO knowledge Gefei previously discussed. The SEO techniques we talked about before are indeed useful. For example, users staying on the website for a long time after searching helps improve rankings.… ( )",
    "labels": [
      "good_material",
      "daily_news"
    ],
    "label_paths": [
      [
        "good_material"
      ],
      [
        "daily_news"
      ]
    ]
  },
  {
    "content": "Alon Albalak (@AlbalakAlon) posted at 8:06 AM on Tue, Feb 27, 2024: {UCSB|AI2|UW|Stanford|MIT|UofT|Vector|Contextual AI} present a survey on🔎Data Selection for LLMs🔍. Training data is a closely guarded secret in industry🤫with this work we narrow the knowledge gap, advocating for open, responsible, collaborative progress.",
    "labels": [
      "good_material",
      "daily_news"
    ],
    "label_paths": [
      [
        "good_material"
      ],
      [
        "daily_news"
      ]
    ]
  },
  {
    "content": "Glowin (@glow1n) posted at 4:30 AM on Wed, Sep 25, 2024:\nThe context of LLM can solve problems, and Gemini Pro already has a million-token context. It's no problem to throw in a medium-sized project, and the rest is a test of prompt ability.\n\nI think code is just an intermediate state, and later we can directly tell the LLM the requirements and generate machine code to run directly.",
    "labels": [
      "daily_news"
    ],
    "label_paths": [
      [
        "daily_news"
      ]
    ]
  },
  {
    "content": "Xiao Hu (@xiaohuggg) posted at 4:22 AM on Tue, Feb 27, 2024:\nMobiLlama: A 0.5B small language model that can run on mobile phones\n\nThis model is designed based on the LLaMA-7B architecture, aiming to run efficiently on edge devices without sending data to remote servers or cloud processing. Such as smartphones, tablets, smartwatches, etc.\n\nAlthough the MobiLlama model is small in size and has low resource requirements, it can still provide high-precision language understanding and generation capabilities.…",
    "labels": [
      "daily_news"
    ],
    "label_paths": [
      [
        "daily_news"
      ]
    ]
  },
  {
    "content": "Y11 (@seclink) posted at 4:21 AM on Fri, May 31, 2024:\nOpenAI shares their best practices in RAG technology:\n\nCustomer needs: They have a large number of documents (e.g., 100,000) and want the model to retrieve knowledge based only on these documents.\n\nSolution:\n1. Directly embed PDF and docx files, accuracy is 45%.\n\n2. After 20 tuning iterations, solve minor bugs - accuracy increased to 65%\n\n3.…",
    "labels": [
      "RAG",
      "LLM",
      "graph"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "graph"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 6:34 PM on Tue, May 28, 2024:\nInteresting! For just $20💰 and 90 minutes, former OpenAI founding member @karpathy replicated the 124M parameter GPT-4 based on llm.c, and released all the details on how to replicate and run it from scratch on an A100🥳👍\n\n8X A100 80GB SXM nodes, ~60% MFU, running cost ~$14/hour, 90 minutes to replicate, even GPU poor people can get started with GPT 😂",
    "labels": [
      "RAG",
      "LLM",
      "good_material",
      "graph"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "good_material"
      ],
      [
        "LLM",
        "RAG",
        "graph"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 11:54 PM on Sun, Jul 21, 2024:\nAlthough Microsoft's GraphRAG is very useful, it is too expensive😂. A 200,000-word book like 'Dickens - A Tale of Two Cities' requires 1M+ tokens to extract the graph. However, the price of GPT-4o\nmini seems to have dropped, and 1M+ tokens only cost one yuan🤔.",
    "labels": [
      "RAG",
      "LLM",
      "graph"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "graph"
      ]
    ]
  },
  {
    "content": "Asuka✨Happy Little Panda (@VoidAsuka) posted at 9:28 AM on Tue, Jul 30, 2024:\nThe concept of GraphRAG is simple, but its effect is revolutionary compared to ordinary RAG. This thread will share my experience from getting started with GraphRAG to practicing it in a week.\nWhat is GraphRAG: Essentially, it is a combination of VectorDB and GraphDB. Vector search returns not chunks but nodes in the graph, and then you can traverse from this node to return the topk.",
    "labels": [
      "RAG",
      "LLM",
      "graph"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "RAG"
      ],
      [
        "LLM",
        "RAG",
        "graph"
      ]
    ]
  },
  {
    "content": "meng shao (@shao__meng) posted at 4:58 PM on Tue, Oct 15, 2024:\nTabled, an open-source data parsing project by marker and surya, another masterpiece by @VikParuchuri, is used for detecting and extracting tables.\n\nUsing surya to find all tables in PDFs, identify rows and columns, and format cells into markdown, csv, or html, it can handle\nPDFs, images, Word documents, and PowerPoint files.\n\n# Main features:\n- Table detection and extraction",
    "labels": [
      "PDF"
    ],
    "label_paths": [
      [
        "PDF"
      ]
    ]
  },
  {
    "content": "AIGCLINK (@aigclink) posted at 6:10 AM on Mon, Jul 22, 2024:\nOCR Tool: RapidOCR\nRapidOCR is an OCR tool that replaces PaddleOCR's inference model with the ONNXRuntime inference engine, converting the PaddleOCR model to ONNX\nformat, greatly improving speed\n\nFeatures:\n4-5 times faster than the PaddlePaddle inference engine\nMulti-platform support, including Python, C++, Java, C#, etc.\nSupports fast offline deployment",
    "labels": [
      "PDF"
    ],
    "label_paths": [
      [
        "PDF"
      ]
    ]
  },
  {
    "content": "Read “Let AI Instantly Parse Heavy Documents: The Magic of MPLUG-DOCOWL2’s Efficient Compression“ by Florian June on Medium",
    "labels": [
      "PDF"
    ],
    "label_paths": [
      [
        "PDF"
      ]
    ]
  },
  {
    "content": "Geek (@geekbb) posted at 5:34 PM on Tue, May 14, 2024:\nConvert PDF to Markdown, can this be deployed on Cloudflare!\n\nA simple and easy-to-deploy API for quickly and accurately converting PDF files to Markdown format.\n- Convert PDF to Markdown.\n- Supports converting multiple PDF files simultaneously.\n- Supports various document types, including books and scientific papers.\n- Supports all languages.\n- Removes headers, footers, and other non-text elements.…",
    "labels": [
      "PDF"
    ],
    "label_paths": [
      [
        "PDF"
      ]
    ]
  },
  {
    "content": "Commit0: Library Generation from Scratch;\n“Agents are provided with a specification document outlining the library’s API as well as a suite of interactive unit tests, with the goal of producing an implementation of this API accordingly”; It seems some researchers just try to use o1, Claude etc. to compose/write advanced software (agent research for coding)",
    "labels": [
      "LLM",
      "paper"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "paper"
      ]
    ]
  },
  {
    "content": "Kalyan KS (@kalyan_kpl) posted at 9:26 AM on Mon, Sep 09, 2024:\nTop LLM Papers of the Week (September Week 1, 2024)\n\nLLMs for AI Agents\n\nSoTA Mixture-of-Expert LLMs\n\nIn Defense of RAG in the Era of Long-Context LLMs\n\nContext Compression in RAG\n\nLLM-based OS\n\nLLMs Agents for Software (Survey)\n\nLight Weight Sports LLM\n\nLarge Language Models in https://t.co/NbH6qAduL2\n(\nhttps://x.com/kalyan_kpl/status/1833180157064138989?t=Hz3Jgz4wZ6hGePHJH1DAvA&s=03\n)",
    "labels": [
      "LLM",
      "paper"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "LLM",
        "paper"
      ]
    ]
  },
  {
    "content": "The biggest problem for many programmers is that they like to study so-called advanced technologies. The more advanced the technology, the further it is from money. In fact, technologies that are close to money are often not advanced and may even seem a bit low in the eyes of many self-proclaimed awesome programmers.",
    "labels": [
      "LLM",
      "product"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "product"
      ]
    ]
  },
  {
    "content": "歸藏(guizang.ai) (@op7418) posted at 1:34 AM on Fri, Aug 02, 2024:\nAndrej Karpathy has a great idea to create an AI music video using the day's top news, which can be fully automated.\n\nThe workflow is as follows:\n\n1. Input the entire front page of The Wall Street Journal into Claude (a large language model)\n\n2. Have Claude generate multiple scenes and provide detailed visual descriptions\n\n3. Input these scene descriptions into the image generation AI ideogram_ai\n\n4.",
    "labels": [
      "LLM",
      "product"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "product"
      ]
    ]
  },
  {
    "content": "Tom Huang (@tuturetom) posted at 7:01 PM on Tue, Oct 15, 2024:\nAfter half a year of in-depth practice in LLM product development, the product has now entered internal testing (feel free to reach out😆, let's talk about 10 industry observations:\n\n1. ChatGPT Canvas has released two scenarios: coding and writing. For coding, there's Cursor, and writing has the potential to become an independent product.\n2. Writing is more universal but also more challenging than coding. The combination of Cursor + ChatGPT Canvas + NotebookLM could bring greater product chemistry.\n\nContinue👇",
    "labels": [
      "LLM",
      "product"
    ],
    "label_paths": [
      [
        "LLM"
      ],
      [
        "product"
      ]
    ]
  }
]